Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
/*
 * Component description for ISC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-11-18T13:40:01Z */
#ifndef _SAMA5D_ISC_COMPONENT_H_
#define _SAMA5D_ISC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ISC                                          */
/* ************************************************************************** */

/* -------- ISC_DAD : (ISC Offset: 0x00) (R/W 32) DMA Address 0 Register -------- */
#define ISC_DAD_AD0_Pos                       _UINT32_(0)                                          /* (ISC_DAD) Channel 0 Address Position */
#define ISC_DAD_AD0_Msk                       (_UINT32_(0xFFFFFFFF) << ISC_DAD_AD0_Pos)            /* (ISC_DAD) Channel 0 Address Mask */
#define ISC_DAD_AD0(value)                    (ISC_DAD_AD0_Msk & (_UINT32_(value) << ISC_DAD_AD0_Pos)) /* Assigment of value for AD0 in the ISC_DAD register */
#define ISC_DAD_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ISC_DAD) Register Mask  */


/* -------- ISC_DST : (ISC Offset: 0x04) (R/W 32) DMA Stride 0 Register -------- */
#define ISC_DST_ST0_Pos                       _UINT32_(0)                                          /* (ISC_DST) Channel 0 Stride Position */
#define ISC_DST_ST0_Msk                       (_UINT32_(0xFFFFFFFF) << ISC_DST_ST0_Pos)            /* (ISC_DST) Channel 0 Stride Mask */
#define ISC_DST_ST0(value)                    (ISC_DST_ST0_Msk & (_UINT32_(value) << ISC_DST_ST0_Pos)) /* Assigment of value for ST0 in the ISC_DST register */
#define ISC_DST_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ISC_DST) Register Mask  */


/* -------- ISC_CTRLEN : (ISC Offset: 0x00) ( /W 32) Control Enable Register -------- */
#define ISC_CTRLEN_CAPTURE_Pos                _UINT32_(0)                                          /* (ISC_CTRLEN) Capture Input Stream Command Position */
#define ISC_CTRLEN_CAPTURE_Msk                (_UINT32_(0x1) << ISC_CTRLEN_CAPTURE_Pos)            /* (ISC_CTRLEN) Capture Input Stream Command Mask */
#define ISC_CTRLEN_CAPTURE(value)             (ISC_CTRLEN_CAPTURE_Msk & (_UINT32_(value) << ISC_CTRLEN_CAPTURE_Pos)) /* Assigment of value for CAPTURE in the ISC_CTRLEN register */
#define ISC_CTRLEN_UPPRO_Pos                  _UINT32_(1)                                          /* (ISC_CTRLEN) Update Profile Position */
#define ISC_CTRLEN_UPPRO_Msk                  (_UINT32_(0x1) << ISC_CTRLEN_UPPRO_Pos)              /* (ISC_CTRLEN) Update Profile Mask */
#define ISC_CTRLEN_UPPRO(value)               (ISC_CTRLEN_UPPRO_Msk & (_UINT32_(value) << ISC_CTRLEN_UPPRO_Pos)) /* Assigment of value for UPPRO in the ISC_CTRLEN register */
#define ISC_CTRLEN_HISREQ_Pos                 _UINT32_(2)                                          /* (ISC_CTRLEN) Histogram Request Position */
#define ISC_CTRLEN_HISREQ_Msk                 (_UINT32_(0x1) << ISC_CTRLEN_HISREQ_Pos)             /* (ISC_CTRLEN) Histogram Request Mask */
#define ISC_CTRLEN_HISREQ(value)              (ISC_CTRLEN_HISREQ_Msk & (_UINT32_(value) << ISC_CTRLEN_HISREQ_Pos)) /* Assigment of value for HISREQ in the ISC_CTRLEN register */
#define ISC_CTRLEN_HISCLR_Pos                 _UINT32_(3)                                          /* (ISC_CTRLEN) Histogram Clear Position */
#define ISC_CTRLEN_HISCLR_Msk                 (_UINT32_(0x1) << ISC_CTRLEN_HISCLR_Pos)             /* (ISC_CTRLEN) Histogram Clear Mask */
#define ISC_CTRLEN_HISCLR(value)              (ISC_CTRLEN_HISCLR_Msk & (_UINT32_(value) << ISC_CTRLEN_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_CTRLEN register */
#define ISC_CTRLEN_Msk                        _UINT32_(0x0000000F)                                 /* (ISC_CTRLEN) Register Mask  */


/* -------- ISC_CTRLDIS : (ISC Offset: 0x04) ( /W 32) Control Disable Register -------- */
#define ISC_CTRLDIS_DISABLE_Pos               _UINT32_(0)                                          /* (ISC_CTRLDIS) Capture Disable Position */
#define ISC_CTRLDIS_DISABLE_Msk               (_UINT32_(0x1) << ISC_CTRLDIS_DISABLE_Pos)           /* (ISC_CTRLDIS) Capture Disable Mask */
#define ISC_CTRLDIS_DISABLE(value)            (ISC_CTRLDIS_DISABLE_Msk & (_UINT32_(value) << ISC_CTRLDIS_DISABLE_Pos)) /* Assigment of value for DISABLE in the ISC_CTRLDIS register */
#define ISC_CTRLDIS_SWRST_Pos                 _UINT32_(8)                                          /* (ISC_CTRLDIS) Software Reset Position */
#define ISC_CTRLDIS_SWRST_Msk                 (_UINT32_(0x1) << ISC_CTRLDIS_SWRST_Pos)             /* (ISC_CTRLDIS) Software Reset Mask */
#define ISC_CTRLDIS_SWRST(value)              (ISC_CTRLDIS_SWRST_Msk & (_UINT32_(value) << ISC_CTRLDIS_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_CTRLDIS register */
#define ISC_CTRLDIS_Msk                       _UINT32_(0x00000101)                                 /* (ISC_CTRLDIS) Register Mask  */


/* -------- ISC_CTRLSR : (ISC Offset: 0x08) ( R/ 32) Control Status Register -------- */
#define ISC_CTRLSR_CAPTURE_Pos                _UINT32_(0)                                          /* (ISC_CTRLSR) Capture pending Position */
#define ISC_CTRLSR_CAPTURE_Msk                (_UINT32_(0x1) << ISC_CTRLSR_CAPTURE_Pos)            /* (ISC_CTRLSR) Capture pending Mask */
#define ISC_CTRLSR_CAPTURE(value)             (ISC_CTRLSR_CAPTURE_Msk & (_UINT32_(value) << ISC_CTRLSR_CAPTURE_Pos)) /* Assigment of value for CAPTURE in the ISC_CTRLSR register */
#define ISC_CTRLSR_UPPRO_Pos                  _UINT32_(1)                                          /* (ISC_CTRLSR) Profile Update Pending Position */
#define ISC_CTRLSR_UPPRO_Msk                  (_UINT32_(0x1) << ISC_CTRLSR_UPPRO_Pos)              /* (ISC_CTRLSR) Profile Update Pending Mask */
#define ISC_CTRLSR_UPPRO(value)               (ISC_CTRLSR_UPPRO_Msk & (_UINT32_(value) << ISC_CTRLSR_UPPRO_Pos)) /* Assigment of value for UPPRO in the ISC_CTRLSR register */
#define ISC_CTRLSR_HISREQ_Pos                 _UINT32_(2)                                          /* (ISC_CTRLSR) Histogram Request Pending Position */
#define ISC_CTRLSR_HISREQ_Msk                 (_UINT32_(0x1) << ISC_CTRLSR_HISREQ_Pos)             /* (ISC_CTRLSR) Histogram Request Pending Mask */
#define ISC_CTRLSR_HISREQ(value)              (ISC_CTRLSR_HISREQ_Msk & (_UINT32_(value) << ISC_CTRLSR_HISREQ_Pos)) /* Assigment of value for HISREQ in the ISC_CTRLSR register */
#define ISC_CTRLSR_FIELD_Pos                  _UINT32_(4)                                          /* (ISC_CTRLSR) Field Status (only relevant when the video stream is interlaced) Position */
#define ISC_CTRLSR_FIELD_Msk                  (_UINT32_(0x1) << ISC_CTRLSR_FIELD_Pos)              /* (ISC_CTRLSR) Field Status (only relevant when the video stream is interlaced) Mask */
#define ISC_CTRLSR_FIELD(value)               (ISC_CTRLSR_FIELD_Msk & (_UINT32_(value) << ISC_CTRLSR_FIELD_Pos)) /* Assigment of value for FIELD in the ISC_CTRLSR register */
#define ISC_CTRLSR_SIP_Pos                    _UINT32_(31)                                         /* (ISC_CTRLSR) Synchronization In Progress Position */
#define ISC_CTRLSR_SIP_Msk                    (_UINT32_(0x1) << ISC_CTRLSR_SIP_Pos)                /* (ISC_CTRLSR) Synchronization In Progress Mask */
#define ISC_CTRLSR_SIP(value)                 (ISC_CTRLSR_SIP_Msk & (_UINT32_(value) << ISC_CTRLSR_SIP_Pos)) /* Assigment of value for SIP in the ISC_CTRLSR register */
#define ISC_CTRLSR_Msk                        _UINT32_(0x80000017)                                 /* (ISC_CTRLSR) Register Mask  */


/* -------- ISC_PFE_CFG0 : (ISC Offset: 0x0C) (R/W 32) Parallel Front End Configuration 0 Register -------- */
#define ISC_PFE_CFG0_HPOL_Pos                 _UINT32_(0)                                          /* (ISC_PFE_CFG0) Horizontal Synchronization Polarity Position */
#define ISC_PFE_CFG0_HPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_HPOL_Pos)             /* (ISC_PFE_CFG0) Horizontal Synchronization Polarity Mask */
#define ISC_PFE_CFG0_HPOL(value)              (ISC_PFE_CFG0_HPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_HPOL_Pos)) /* Assigment of value for HPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_VPOL_Pos                 _UINT32_(1)                                          /* (ISC_PFE_CFG0) Vertical Synchronization Polarity Position */
#define ISC_PFE_CFG0_VPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_VPOL_Pos)             /* (ISC_PFE_CFG0) Vertical Synchronization Polarity Mask */
#define ISC_PFE_CFG0_VPOL(value)              (ISC_PFE_CFG0_VPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_VPOL_Pos)) /* Assigment of value for VPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_PPOL_Pos                 _UINT32_(2)                                          /* (ISC_PFE_CFG0) Pixel Clock Polarity Position */
#define ISC_PFE_CFG0_PPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_PPOL_Pos)             /* (ISC_PFE_CFG0) Pixel Clock Polarity Mask */
#define ISC_PFE_CFG0_PPOL(value)              (ISC_PFE_CFG0_PPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_PPOL_Pos)) /* Assigment of value for PPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_FPOL_Pos                 _UINT32_(3)                                          /* (ISC_PFE_CFG0) Field Polarity Position */
#define ISC_PFE_CFG0_FPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_FPOL_Pos)             /* (ISC_PFE_CFG0) Field Polarity Mask */
#define ISC_PFE_CFG0_FPOL(value)              (ISC_PFE_CFG0_FPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_FPOL_Pos)) /* Assigment of value for FPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_MODE_Pos                 _UINT32_(4)                                          /* (ISC_PFE_CFG0) Parallel Front End Mode Position */
#define ISC_PFE_CFG0_MODE_Msk                 (_UINT32_(0x7) << ISC_PFE_CFG0_MODE_Pos)             /* (ISC_PFE_CFG0) Parallel Front End Mode Mask */
#define ISC_PFE_CFG0_MODE(value)              (ISC_PFE_CFG0_MODE_Msk & (_UINT32_(value) << ISC_PFE_CFG0_MODE_Pos)) /* Assigment of value for MODE in the ISC_PFE_CFG0 register */
#define   ISC_PFE_CFG0_MODE_PROGRESSIVE_Val   _UINT32_(0x0)                                        /* (ISC_PFE_CFG0) Video source is progressive.  */
#define   ISC_PFE_CFG0_MODE_DF_TOP_Val        _UINT32_(0x1)                                        /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with top field.  */
#define   ISC_PFE_CFG0_MODE_DF_BOTTOM_Val     _UINT32_(0x2)                                        /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with bottom field.  */
#define   ISC_PFE_CFG0_MODE_DF_IMMEDIATE_Val  _UINT32_(0x3)                                        /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured immediately.  */
#define   ISC_PFE_CFG0_MODE_SF_TOP_Val        _UINT32_(0x4)                                        /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the top field.  */
#define   ISC_PFE_CFG0_MODE_SF_BOTTOM_Val     _UINT32_(0x5)                                        /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the bottom field.  */
#define   ISC_PFE_CFG0_MODE_SF_IMMEDIATE_Val  _UINT32_(0x6)                                        /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting immediately.  */
#define ISC_PFE_CFG0_MODE_PROGRESSIVE         (ISC_PFE_CFG0_MODE_PROGRESSIVE_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is progressive. Position  */
#define ISC_PFE_CFG0_MODE_DF_TOP              (ISC_PFE_CFG0_MODE_DF_TOP_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with top field. Position  */
#define ISC_PFE_CFG0_MODE_DF_BOTTOM           (ISC_PFE_CFG0_MODE_DF_BOTTOM_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with bottom field. Position  */
#define ISC_PFE_CFG0_MODE_DF_IMMEDIATE        (ISC_PFE_CFG0_MODE_DF_IMMEDIATE_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured immediately. Position  */
#define ISC_PFE_CFG0_MODE_SF_TOP              (ISC_PFE_CFG0_MODE_SF_TOP_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the top field. Position  */
#define ISC_PFE_CFG0_MODE_SF_BOTTOM           (ISC_PFE_CFG0_MODE_SF_BOTTOM_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the bottom field. Position  */
#define ISC_PFE_CFG0_MODE_SF_IMMEDIATE        (ISC_PFE_CFG0_MODE_SF_IMMEDIATE_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting immediately. Position  */
#define ISC_PFE_CFG0_CONT_Pos                 _UINT32_(7)                                          /* (ISC_PFE_CFG0) Continuous Acquisition Position */
#define ISC_PFE_CFG0_CONT_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_CONT_Pos)             /* (ISC_PFE_CFG0) Continuous Acquisition Mask */
#define ISC_PFE_CFG0_CONT(value)              (ISC_PFE_CFG0_CONT_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CONT_Pos)) /* Assigment of value for CONT in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_GATED_Pos                _UINT32_(8)                                          /* (ISC_PFE_CFG0) Gated input clock Position */
#define ISC_PFE_CFG0_GATED_Msk                (_UINT32_(0x1) << ISC_PFE_CFG0_GATED_Pos)            /* (ISC_PFE_CFG0) Gated input clock Mask */
#define ISC_PFE_CFG0_GATED(value)             (ISC_PFE_CFG0_GATED_Msk & (_UINT32_(value) << ISC_PFE_CFG0_GATED_Pos)) /* Assigment of value for GATED in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR656_Pos              _UINT32_(9)                                          /* (ISC_PFE_CFG0) CCIR656 input mode Position */
#define ISC_PFE_CFG0_CCIR656_Msk              (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR656_Pos)          /* (ISC_PFE_CFG0) CCIR656 input mode Mask */
#define ISC_PFE_CFG0_CCIR656(value)           (ISC_PFE_CFG0_CCIR656_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR656_Pos)) /* Assigment of value for CCIR656 in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR_CRC_Pos             _UINT32_(10)                                         /* (ISC_PFE_CFG0) CCIR656 CRC Decoder Position */
#define ISC_PFE_CFG0_CCIR_CRC_Msk             (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR_CRC_Pos)         /* (ISC_PFE_CFG0) CCIR656 CRC Decoder Mask */
#define ISC_PFE_CFG0_CCIR_CRC(value)          (ISC_PFE_CFG0_CCIR_CRC_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR_CRC_Pos)) /* Assigment of value for CCIR_CRC in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR10_8N_Pos            _UINT32_(11)                                         /* (ISC_PFE_CFG0) CCIR 10 bits or 8 bits Position */
#define ISC_PFE_CFG0_CCIR10_8N_Msk            (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR10_8N_Pos)        /* (ISC_PFE_CFG0) CCIR 10 bits or 8 bits Mask */
#define ISC_PFE_CFG0_CCIR10_8N(value)         (ISC_PFE_CFG0_CCIR10_8N_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR10_8N_Pos)) /* Assigment of value for CCIR10_8N in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_COLEN_Pos                _UINT32_(12)                                         /* (ISC_PFE_CFG0) Column Cropping Enable Position */
#define ISC_PFE_CFG0_COLEN_Msk                (_UINT32_(0x1) << ISC_PFE_CFG0_COLEN_Pos)            /* (ISC_PFE_CFG0) Column Cropping Enable Mask */
#define ISC_PFE_CFG0_COLEN(value)             (ISC_PFE_CFG0_COLEN_Msk & (_UINT32_(value) << ISC_PFE_CFG0_COLEN_Pos)) /* Assigment of value for COLEN in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_ROWEN_Pos                _UINT32_(13)                                         /* (ISC_PFE_CFG0) Row Cropping Enable Position */
#define ISC_PFE_CFG0_ROWEN_Msk                (_UINT32_(0x1) << ISC_PFE_CFG0_ROWEN_Pos)            /* (ISC_PFE_CFG0) Row Cropping Enable Mask */
#define ISC_PFE_CFG0_ROWEN(value)             (ISC_PFE_CFG0_ROWEN_Msk & (_UINT32_(value) << ISC_PFE_CFG0_ROWEN_Pos)) /* Assigment of value for ROWEN in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_SKIPCNT_Pos              _UINT32_(16)                                         /* (ISC_PFE_CFG0) Frame Skipping Counter Position */
#define ISC_PFE_CFG0_SKIPCNT_Msk              (_UINT32_(0xFF) << ISC_PFE_CFG0_SKIPCNT_Pos)         /* (ISC_PFE_CFG0) Frame Skipping Counter Mask */
#define ISC_PFE_CFG0_SKIPCNT(value)           (ISC_PFE_CFG0_SKIPCNT_Msk & (_UINT32_(value) << ISC_PFE_CFG0_SKIPCNT_Pos)) /* Assigment of value for SKIPCNT in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR_REP_Pos             _UINT32_(27)                                         /* (ISC_PFE_CFG0) CCIR Replication Position */
#define ISC_PFE_CFG0_CCIR_REP_Msk             (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR_REP_Pos)         /* (ISC_PFE_CFG0) CCIR Replication Mask */
#define ISC_PFE_CFG0_CCIR_REP(value)          (ISC_PFE_CFG0_CCIR_REP_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR_REP_Pos)) /* Assigment of value for CCIR_REP in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_BPS_Pos                  _UINT32_(28)                                         /* (ISC_PFE_CFG0) Bits Per Sample Position */
#define ISC_PFE_CFG0_BPS_Msk                  (_UINT32_(0x7) << ISC_PFE_CFG0_BPS_Pos)              /* (ISC_PFE_CFG0) Bits Per Sample Mask */
#define ISC_PFE_CFG0_BPS(value)               (ISC_PFE_CFG0_BPS_Msk & (_UINT32_(value) << ISC_PFE_CFG0_BPS_Pos)) /* Assigment of value for BPS in the ISC_PFE_CFG0 register */
#define   ISC_PFE_CFG0_BPS_TWELVE_Val         _UINT32_(0x0)                                        /* (ISC_PFE_CFG0) 12-bit input  */
#define   ISC_PFE_CFG0_BPS_ELEVEN_Val         _UINT32_(0x1)                                        /* (ISC_PFE_CFG0) 11-bit input  */
#define   ISC_PFE_CFG0_BPS_TEN_Val            _UINT32_(0x2)                                        /* (ISC_PFE_CFG0) 10-bit input  */
#define   ISC_PFE_CFG0_BPS_NINE_Val           _UINT32_(0x3)                                        /* (ISC_PFE_CFG0) 9-bit input  */
#define   ISC_PFE_CFG0_BPS_EIGHT_Val          _UINT32_(0x4)                                        /* (ISC_PFE_CFG0) 8-bit input  */
#define ISC_PFE_CFG0_BPS_TWELVE               (ISC_PFE_CFG0_BPS_TWELVE_Val << ISC_PFE_CFG0_BPS_Pos) /* (ISC_PFE_CFG0) 12-bit input Position  */
#define ISC_PFE_CFG0_BPS_ELEVEN               (ISC_PFE_CFG0_BPS_ELEVEN_Val << ISC_PFE_CFG0_BPS_Pos) /* (ISC_PFE_CFG0) 11-bit input Position  */
#define ISC_PFE_CFG0_BPS_TEN                  (ISC_PFE_CFG0_BPS_TEN_Val << ISC_PFE_CFG0_BPS_Pos)   /* (ISC_PFE_CFG0) 10-bit input Position  */
#define ISC_PFE_CFG0_BPS_NINE                 (ISC_PFE_CFG0_BPS_NINE_Val << ISC_PFE_CFG0_BPS_Pos)  /* (ISC_PFE_CFG0) 9-bit input Position  */
#define ISC_PFE_CFG0_BPS_EIGHT                (ISC_PFE_CFG0_BPS_EIGHT_Val << ISC_PFE_CFG0_BPS_Pos) /* (ISC_PFE_CFG0) 8-bit input Position  */
#define ISC_PFE_CFG0_REP_Pos                  _UINT32_(31)                                         /* (ISC_PFE_CFG0) Up Multiply with Replication Position */
#define ISC_PFE_CFG0_REP_Msk                  (_UINT32_(0x1) << ISC_PFE_CFG0_REP_Pos)              /* (ISC_PFE_CFG0) Up Multiply with Replication Mask */
#define ISC_PFE_CFG0_REP(value)               (ISC_PFE_CFG0_REP_Msk & (_UINT32_(value) << ISC_PFE_CFG0_REP_Pos)) /* Assigment of value for REP in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_Msk                      _UINT32_(0xF8FF3FFF)                                 /* (ISC_PFE_CFG0) Register Mask  */

#define ISC_PFE_CFG0_CCIR_Pos                 _UINT32_(9)                                          /* (ISC_PFE_CFG0 Position) CCIR656 input mode */
#define ISC_PFE_CFG0_CCIR_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR_Pos)             /* (ISC_PFE_CFG0 Mask) CCIR */
#define ISC_PFE_CFG0_CCIR(value)              (ISC_PFE_CFG0_CCIR_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR_Pos)) 

/* -------- ISC_PFE_CFG1 : (ISC Offset: 0x10) (R/W 32) Parallel Front End Configuration 1 Register -------- */
#define ISC_PFE_CFG1_COLMIN_Pos               _UINT32_(0)                                          /* (ISC_PFE_CFG1) Column Minimum Limit Position */
#define ISC_PFE_CFG1_COLMIN_Msk               (_UINT32_(0xFFFF) << ISC_PFE_CFG1_COLMIN_Pos)        /* (ISC_PFE_CFG1) Column Minimum Limit Mask */
#define ISC_PFE_CFG1_COLMIN(value)            (ISC_PFE_CFG1_COLMIN_Msk & (_UINT32_(value) << ISC_PFE_CFG1_COLMIN_Pos)) /* Assigment of value for COLMIN in the ISC_PFE_CFG1 register */
#define ISC_PFE_CFG1_COLMAX_Pos               _UINT32_(16)                                         /* (ISC_PFE_CFG1) Column Maximum Limit Position */
#define ISC_PFE_CFG1_COLMAX_Msk               (_UINT32_(0xFFFF) << ISC_PFE_CFG1_COLMAX_Pos)        /* (ISC_PFE_CFG1) Column Maximum Limit Mask */
#define ISC_PFE_CFG1_COLMAX(value)            (ISC_PFE_CFG1_COLMAX_Msk & (_UINT32_(value) << ISC_PFE_CFG1_COLMAX_Pos)) /* Assigment of value for COLMAX in the ISC_PFE_CFG1 register */
#define ISC_PFE_CFG1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ISC_PFE_CFG1) Register Mask  */


/* -------- ISC_PFE_CFG2 : (ISC Offset: 0x14) (R/W 32) Parallel Front End Configuration 2 Register -------- */
#define ISC_PFE_CFG2_ROWMIN_Pos               _UINT32_(0)                                          /* (ISC_PFE_CFG2) Row Minimum Limit Position */
#define ISC_PFE_CFG2_ROWMIN_Msk               (_UINT32_(0xFFFF) << ISC_PFE_CFG2_ROWMIN_Pos)        /* (ISC_PFE_CFG2) Row Minimum Limit Mask */
#define ISC_PFE_CFG2_ROWMIN(value)            (ISC_PFE_CFG2_ROWMIN_Msk & (_UINT32_(value) << ISC_PFE_CFG2_ROWMIN_Pos)) /* Assigment of value for ROWMIN in the ISC_PFE_CFG2 register */
#define ISC_PFE_CFG2_ROWMAX_Pos               _UINT32_(16)                                         /* (ISC_PFE_CFG2) Row Maximum Limit Position */
#define ISC_PFE_CFG2_ROWMAX_Msk               (_UINT32_(0xFFFF) << ISC_PFE_CFG2_ROWMAX_Pos)        /* (ISC_PFE_CFG2) Row Maximum Limit Mask */
#define ISC_PFE_CFG2_ROWMAX(value)            (ISC_PFE_CFG2_ROWMAX_Msk & (_UINT32_(value) << ISC_PFE_CFG2_ROWMAX_Pos)) /* Assigment of value for ROWMAX in the ISC_PFE_CFG2 register */
#define ISC_PFE_CFG2_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ISC_PFE_CFG2) Register Mask  */


