Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
/* -------- ISC_CLKEN : (ISC Offset: 0x18) ( /W 32) Clock Enable Register -------- */
#define ISC_CLKEN_ICEN_Pos                    _UINT32_(0)                                          /* (ISC_CLKEN) ISP Clock Enable Position */
#define ISC_CLKEN_ICEN_Msk                    (_UINT32_(0x1) << ISC_CLKEN_ICEN_Pos)                /* (ISC_CLKEN) ISP Clock Enable Mask */
#define ISC_CLKEN_ICEN(value)                 (ISC_CLKEN_ICEN_Msk & (_UINT32_(value) << ISC_CLKEN_ICEN_Pos)) /* Assigment of value for ICEN in the ISC_CLKEN register */
#define ISC_CLKEN_MCEN_Pos                    _UINT32_(1)                                          /* (ISC_CLKEN) Master Clock Enable Position */
#define ISC_CLKEN_MCEN_Msk                    (_UINT32_(0x1) << ISC_CLKEN_MCEN_Pos)                /* (ISC_CLKEN) Master Clock Enable Mask */
#define ISC_CLKEN_MCEN(value)                 (ISC_CLKEN_MCEN_Msk & (_UINT32_(value) << ISC_CLKEN_MCEN_Pos)) /* Assigment of value for MCEN in the ISC_CLKEN register */
#define ISC_CLKEN_Msk                         _UINT32_(0x00000003)                                 /* (ISC_CLKEN) Register Mask  */


/* -------- ISC_CLKDIS : (ISC Offset: 0x1C) ( /W 32) Clock Disable Register -------- */
#define ISC_CLKDIS_ICDIS_Pos                  _UINT32_(0)                                          /* (ISC_CLKDIS) ISP Clock Disable Position */
#define ISC_CLKDIS_ICDIS_Msk                  (_UINT32_(0x1) << ISC_CLKDIS_ICDIS_Pos)              /* (ISC_CLKDIS) ISP Clock Disable Mask */
#define ISC_CLKDIS_ICDIS(value)               (ISC_CLKDIS_ICDIS_Msk & (_UINT32_(value) << ISC_CLKDIS_ICDIS_Pos)) /* Assigment of value for ICDIS in the ISC_CLKDIS register */
#define ISC_CLKDIS_MCDIS_Pos                  _UINT32_(1)                                          /* (ISC_CLKDIS) Master Clock Disable Position */
#define ISC_CLKDIS_MCDIS_Msk                  (_UINT32_(0x1) << ISC_CLKDIS_MCDIS_Pos)              /* (ISC_CLKDIS) Master Clock Disable Mask */
#define ISC_CLKDIS_MCDIS(value)               (ISC_CLKDIS_MCDIS_Msk & (_UINT32_(value) << ISC_CLKDIS_MCDIS_Pos)) /* Assigment of value for MCDIS in the ISC_CLKDIS register */
#define ISC_CLKDIS_ICSWRST_Pos                _UINT32_(8)                                          /* (ISC_CLKDIS) ISP Clock Software Reset Position */
#define ISC_CLKDIS_ICSWRST_Msk                (_UINT32_(0x1) << ISC_CLKDIS_ICSWRST_Pos)            /* (ISC_CLKDIS) ISP Clock Software Reset Mask */
#define ISC_CLKDIS_ICSWRST(value)             (ISC_CLKDIS_ICSWRST_Msk & (_UINT32_(value) << ISC_CLKDIS_ICSWRST_Pos)) /* Assigment of value for ICSWRST in the ISC_CLKDIS register */
#define ISC_CLKDIS_MCSWRST_Pos                _UINT32_(9)                                          /* (ISC_CLKDIS) Master Clock Software Reset Position */
#define ISC_CLKDIS_MCSWRST_Msk                (_UINT32_(0x1) << ISC_CLKDIS_MCSWRST_Pos)            /* (ISC_CLKDIS) Master Clock Software Reset Mask */
#define ISC_CLKDIS_MCSWRST(value)             (ISC_CLKDIS_MCSWRST_Msk & (_UINT32_(value) << ISC_CLKDIS_MCSWRST_Pos)) /* Assigment of value for MCSWRST in the ISC_CLKDIS register */
#define ISC_CLKDIS_Msk                        _UINT32_(0x00000303)                                 /* (ISC_CLKDIS) Register Mask  */


/* -------- ISC_CLKSR : (ISC Offset: 0x20) ( R/ 32) Clock Status Register -------- */
#define ISC_CLKSR_ICSR_Pos                    _UINT32_(0)                                          /* (ISC_CLKSR) ISP Clock Status Register Position */
#define ISC_CLKSR_ICSR_Msk                    (_UINT32_(0x1) << ISC_CLKSR_ICSR_Pos)                /* (ISC_CLKSR) ISP Clock Status Register Mask */
#define ISC_CLKSR_ICSR(value)                 (ISC_CLKSR_ICSR_Msk & (_UINT32_(value) << ISC_CLKSR_ICSR_Pos)) /* Assigment of value for ICSR in the ISC_CLKSR register */
#define ISC_CLKSR_MCSR_Pos                    _UINT32_(1)                                          /* (ISC_CLKSR) Master Clock Status Register Position */
#define ISC_CLKSR_MCSR_Msk                    (_UINT32_(0x1) << ISC_CLKSR_MCSR_Pos)                /* (ISC_CLKSR) Master Clock Status Register Mask */
#define ISC_CLKSR_MCSR(value)                 (ISC_CLKSR_MCSR_Msk & (_UINT32_(value) << ISC_CLKSR_MCSR_Pos)) /* Assigment of value for MCSR in the ISC_CLKSR register */
#define ISC_CLKSR_SIP_Pos                     _UINT32_(31)                                         /* (ISC_CLKSR) Synchronization In Progress Position */
#define ISC_CLKSR_SIP_Msk                     (_UINT32_(0x1) << ISC_CLKSR_SIP_Pos)                 /* (ISC_CLKSR) Synchronization In Progress Mask */
#define ISC_CLKSR_SIP(value)                  (ISC_CLKSR_SIP_Msk & (_UINT32_(value) << ISC_CLKSR_SIP_Pos)) /* Assigment of value for SIP in the ISC_CLKSR register */
#define ISC_CLKSR_Msk                         _UINT32_(0x80000003)                                 /* (ISC_CLKSR) Register Mask  */


/* -------- ISC_CLKCFG : (ISC Offset: 0x24) (R/W 32) Clock Configuration Register -------- */
#define ISC_CLKCFG_ICDIV_Pos                  _UINT32_(0)                                          /* (ISC_CLKCFG) ISP Clock Divider Position */
#define ISC_CLKCFG_ICDIV_Msk                  (_UINT32_(0xFF) << ISC_CLKCFG_ICDIV_Pos)             /* (ISC_CLKCFG) ISP Clock Divider Mask */
#define ISC_CLKCFG_ICDIV(value)               (ISC_CLKCFG_ICDIV_Msk & (_UINT32_(value) << ISC_CLKCFG_ICDIV_Pos)) /* Assigment of value for ICDIV in the ISC_CLKCFG register */
#define ISC_CLKCFG_ICSEL_Pos                  _UINT32_(8)                                          /* (ISC_CLKCFG) ISP Clock Selection Position */
#define ISC_CLKCFG_ICSEL_Msk                  (_UINT32_(0x1) << ISC_CLKCFG_ICSEL_Pos)              /* (ISC_CLKCFG) ISP Clock Selection Mask */
#define ISC_CLKCFG_ICSEL(value)               (ISC_CLKCFG_ICSEL_Msk & (_UINT32_(value) << ISC_CLKCFG_ICSEL_Pos)) /* Assigment of value for ICSEL in the ISC_CLKCFG register */
#define ISC_CLKCFG_MCDIV_Pos                  _UINT32_(16)                                         /* (ISC_CLKCFG) Master Clock Divider Position */
#define ISC_CLKCFG_MCDIV_Msk                  (_UINT32_(0xFF) << ISC_CLKCFG_MCDIV_Pos)             /* (ISC_CLKCFG) Master Clock Divider Mask */
#define ISC_CLKCFG_MCDIV(value)               (ISC_CLKCFG_MCDIV_Msk & (_UINT32_(value) << ISC_CLKCFG_MCDIV_Pos)) /* Assigment of value for MCDIV in the ISC_CLKCFG register */
#define ISC_CLKCFG_MCSEL_Pos                  _UINT32_(24)                                         /* (ISC_CLKCFG) Master Clock Reference Clock Selection Position */
#define ISC_CLKCFG_MCSEL_Msk                  (_UINT32_(0x3) << ISC_CLKCFG_MCSEL_Pos)              /* (ISC_CLKCFG) Master Clock Reference Clock Selection Mask */
#define ISC_CLKCFG_MCSEL(value)               (ISC_CLKCFG_MCSEL_Msk & (_UINT32_(value) << ISC_CLKCFG_MCSEL_Pos)) /* Assigment of value for MCSEL in the ISC_CLKCFG register */
#define ISC_CLKCFG_Msk                        _UINT32_(0x03FF01FF)                                 /* (ISC_CLKCFG) Register Mask  */


/* -------- ISC_INTEN : (ISC Offset: 0x28) ( /W 32) Interrupt Enable Register -------- */
#define ISC_INTEN_VD_Pos                      _UINT32_(0)                                          /* (ISC_INTEN) Vertical Synchronization Detection Interrupt Enable Position */
#define ISC_INTEN_VD_Msk                      (_UINT32_(0x1) << ISC_INTEN_VD_Pos)                  /* (ISC_INTEN) Vertical Synchronization Detection Interrupt Enable Mask */
#define ISC_INTEN_VD(value)                   (ISC_INTEN_VD_Msk & (_UINT32_(value) << ISC_INTEN_VD_Pos)) /* Assigment of value for VD in the ISC_INTEN register */
#define ISC_INTEN_HD_Pos                      _UINT32_(1)                                          /* (ISC_INTEN) Horizontal Synchronization Detection Interrupt Enable Position */
#define ISC_INTEN_HD_Msk                      (_UINT32_(0x1) << ISC_INTEN_HD_Pos)                  /* (ISC_INTEN) Horizontal Synchronization Detection Interrupt Enable Mask */
#define ISC_INTEN_HD(value)                   (ISC_INTEN_HD_Msk & (_UINT32_(value) << ISC_INTEN_HD_Pos)) /* Assigment of value for HD in the ISC_INTEN register */
#define ISC_INTEN_SWRST_Pos                   _UINT32_(4)                                          /* (ISC_INTEN) Software Reset Completed Interrupt Enable Position */
#define ISC_INTEN_SWRST_Msk                   (_UINT32_(0x1) << ISC_INTEN_SWRST_Pos)               /* (ISC_INTEN) Software Reset Completed Interrupt Enable Mask */
#define ISC_INTEN_SWRST(value)                (ISC_INTEN_SWRST_Msk & (_UINT32_(value) << ISC_INTEN_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTEN register */
#define ISC_INTEN_DIS_Pos                     _UINT32_(5)                                          /* (ISC_INTEN) Disable Completed Interrupt Enable Position */
#define ISC_INTEN_DIS_Msk                     (_UINT32_(0x1) << ISC_INTEN_DIS_Pos)                 /* (ISC_INTEN) Disable Completed Interrupt Enable Mask */
#define ISC_INTEN_DIS(value)                  (ISC_INTEN_DIS_Msk & (_UINT32_(value) << ISC_INTEN_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTEN register */
#define ISC_INTEN_DDONE_Pos                   _UINT32_(8)                                          /* (ISC_INTEN) DMA Done Interrupt Enable Position */
#define ISC_INTEN_DDONE_Msk                   (_UINT32_(0x1) << ISC_INTEN_DDONE_Pos)               /* (ISC_INTEN) DMA Done Interrupt Enable Mask */
#define ISC_INTEN_DDONE(value)                (ISC_INTEN_DDONE_Msk & (_UINT32_(value) << ISC_INTEN_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTEN register */
#define ISC_INTEN_LDONE_Pos                   _UINT32_(9)                                          /* (ISC_INTEN) DMA List Done Interrupt Enable Position */
#define ISC_INTEN_LDONE_Msk                   (_UINT32_(0x1) << ISC_INTEN_LDONE_Pos)               /* (ISC_INTEN) DMA List Done Interrupt Enable Mask */
#define ISC_INTEN_LDONE(value)                (ISC_INTEN_LDONE_Msk & (_UINT32_(value) << ISC_INTEN_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTEN register */
#define ISC_INTEN_HISDONE_Pos                 _UINT32_(12)                                         /* (ISC_INTEN) Histogram Completed Interrupt Enable Position */
#define ISC_INTEN_HISDONE_Msk                 (_UINT32_(0x1) << ISC_INTEN_HISDONE_Pos)             /* (ISC_INTEN) Histogram Completed Interrupt Enable Mask */
#define ISC_INTEN_HISDONE(value)              (ISC_INTEN_HISDONE_Msk & (_UINT32_(value) << ISC_INTEN_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTEN register */
#define ISC_INTEN_HISCLR_Pos                  _UINT32_(13)                                         /* (ISC_INTEN) Histogram Clear Interrupt Enable Position */
#define ISC_INTEN_HISCLR_Msk                  (_UINT32_(0x1) << ISC_INTEN_HISCLR_Pos)              /* (ISC_INTEN) Histogram Clear Interrupt Enable Mask */
#define ISC_INTEN_HISCLR(value)               (ISC_INTEN_HISCLR_Msk & (_UINT32_(value) << ISC_INTEN_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTEN register */
#define ISC_INTEN_WERR_Pos                    _UINT32_(16)                                         /* (ISC_INTEN) Write Channel Error Interrupt Enable Position */
#define ISC_INTEN_WERR_Msk                    (_UINT32_(0x1) << ISC_INTEN_WERR_Pos)                /* (ISC_INTEN) Write Channel Error Interrupt Enable Mask */
#define ISC_INTEN_WERR(value)                 (ISC_INTEN_WERR_Msk & (_UINT32_(value) << ISC_INTEN_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTEN register */
#define ISC_INTEN_RERR_Pos                    _UINT32_(20)                                         /* (ISC_INTEN) Read Channel Error Interrupt Enable Position */
#define ISC_INTEN_RERR_Msk                    (_UINT32_(0x1) << ISC_INTEN_RERR_Pos)                /* (ISC_INTEN) Read Channel Error Interrupt Enable Mask */
#define ISC_INTEN_RERR(value)                 (ISC_INTEN_RERR_Msk & (_UINT32_(value) << ISC_INTEN_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTEN register */
#define ISC_INTEN_VFPOV_Pos                   _UINT32_(24)                                         /* (ISC_INTEN) Vertical Front Porch Overflow Interrupt Enable Position */
#define ISC_INTEN_VFPOV_Msk                   (_UINT32_(0x1) << ISC_INTEN_VFPOV_Pos)               /* (ISC_INTEN) Vertical Front Porch Overflow Interrupt Enable Mask */
#define ISC_INTEN_VFPOV(value)                (ISC_INTEN_VFPOV_Msk & (_UINT32_(value) << ISC_INTEN_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTEN register */
#define ISC_INTEN_DAOV_Pos                    _UINT32_(25)                                         /* (ISC_INTEN) Data Overflow Interrupt Enable Position */
#define ISC_INTEN_DAOV_Msk                    (_UINT32_(0x1) << ISC_INTEN_DAOV_Pos)                /* (ISC_INTEN) Data Overflow Interrupt Enable Mask */
#define ISC_INTEN_DAOV(value)                 (ISC_INTEN_DAOV_Msk & (_UINT32_(value) << ISC_INTEN_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTEN register */
#define ISC_INTEN_VDTO_Pos                    _UINT32_(26)                                         /* (ISC_INTEN) Vertical Synchronization Timeout Interrupt Enable Position */
#define ISC_INTEN_VDTO_Msk                    (_UINT32_(0x1) << ISC_INTEN_VDTO_Pos)                /* (ISC_INTEN) Vertical Synchronization Timeout Interrupt Enable Mask */
#define ISC_INTEN_VDTO(value)                 (ISC_INTEN_VDTO_Msk & (_UINT32_(value) << ISC_INTEN_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTEN register */
#define ISC_INTEN_HDTO_Pos                    _UINT32_(27)                                         /* (ISC_INTEN) Horizontal Synchronization Timeout Interrupt Enable Position */
#define ISC_INTEN_HDTO_Msk                    (_UINT32_(0x1) << ISC_INTEN_HDTO_Pos)                /* (ISC_INTEN) Horizontal Synchronization Timeout Interrupt Enable Mask */
#define ISC_INTEN_HDTO(value)                 (ISC_INTEN_HDTO_Msk & (_UINT32_(value) << ISC_INTEN_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTEN register */
#define ISC_INTEN_CCIRERR_Pos                 _UINT32_(28)                                         /* (ISC_INTEN) CCIR Decoder Error Interrupt Enable Position */
#define ISC_INTEN_CCIRERR_Msk                 (_UINT32_(0x1) << ISC_INTEN_CCIRERR_Pos)             /* (ISC_INTEN) CCIR Decoder Error Interrupt Enable Mask */
#define ISC_INTEN_CCIRERR(value)              (ISC_INTEN_CCIRERR_Msk & (_UINT32_(value) << ISC_INTEN_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTEN register */
#define ISC_INTEN_Msk                         _UINT32_(0x1F113333)                                 /* (ISC_INTEN) Register Mask  */


/* -------- ISC_INTDIS : (ISC Offset: 0x2C) ( /W 32) Interrupt Disable Register -------- */
#define ISC_INTDIS_VD_Pos                     _UINT32_(0)                                          /* (ISC_INTDIS) Vertical Synchronization Detection Interrupt Disable Position */
#define ISC_INTDIS_VD_Msk                     (_UINT32_(0x1) << ISC_INTDIS_VD_Pos)                 /* (ISC_INTDIS) Vertical Synchronization Detection Interrupt Disable Mask */
#define ISC_INTDIS_VD(value)                  (ISC_INTDIS_VD_Msk & (_UINT32_(value) << ISC_INTDIS_VD_Pos)) /* Assigment of value for VD in the ISC_INTDIS register */
#define ISC_INTDIS_HD_Pos                     _UINT32_(1)                                          /* (ISC_INTDIS) Horizontal Synchronization Detection Interrupt Disable Position */
#define ISC_INTDIS_HD_Msk                     (_UINT32_(0x1) << ISC_INTDIS_HD_Pos)                 /* (ISC_INTDIS) Horizontal Synchronization Detection Interrupt Disable Mask */
#define ISC_INTDIS_HD(value)                  (ISC_INTDIS_HD_Msk & (_UINT32_(value) << ISC_INTDIS_HD_Pos)) /* Assigment of value for HD in the ISC_INTDIS register */
#define ISC_INTDIS_SWRST_Pos                  _UINT32_(4)                                          /* (ISC_INTDIS) Software Reset Completed Interrupt Disable Position */
#define ISC_INTDIS_SWRST_Msk                  (_UINT32_(0x1) << ISC_INTDIS_SWRST_Pos)              /* (ISC_INTDIS) Software Reset Completed Interrupt Disable Mask */
#define ISC_INTDIS_SWRST(value)               (ISC_INTDIS_SWRST_Msk & (_UINT32_(value) << ISC_INTDIS_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTDIS register */
#define ISC_INTDIS_DIS_Pos                    _UINT32_(5)                                          /* (ISC_INTDIS) Disable Completed Interrupt Disable Position */
#define ISC_INTDIS_DIS_Msk                    (_UINT32_(0x1) << ISC_INTDIS_DIS_Pos)                /* (ISC_INTDIS) Disable Completed Interrupt Disable Mask */
#define ISC_INTDIS_DIS(value)                 (ISC_INTDIS_DIS_Msk & (_UINT32_(value) << ISC_INTDIS_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTDIS register */
#define ISC_INTDIS_DDONE_Pos                  _UINT32_(8)                                          /* (ISC_INTDIS) DMA Done Interrupt Disable Position */
#define ISC_INTDIS_DDONE_Msk                  (_UINT32_(0x1) << ISC_INTDIS_DDONE_Pos)              /* (ISC_INTDIS) DMA Done Interrupt Disable Mask */
#define ISC_INTDIS_DDONE(value)               (ISC_INTDIS_DDONE_Msk & (_UINT32_(value) << ISC_INTDIS_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTDIS register */
#define ISC_INTDIS_LDONE_Pos                  _UINT32_(9)                                          /* (ISC_INTDIS) DMA List Done Interrupt Disable Position */
#define ISC_INTDIS_LDONE_Msk                  (_UINT32_(0x1) << ISC_INTDIS_LDONE_Pos)              /* (ISC_INTDIS) DMA List Done Interrupt Disable Mask */
#define ISC_INTDIS_LDONE(value)               (ISC_INTDIS_LDONE_Msk & (_UINT32_(value) << ISC_INTDIS_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTDIS register */
#define ISC_INTDIS_HISDONE_Pos                _UINT32_(12)                                         /* (ISC_INTDIS) Histogram Completed Interrupt Disable Position */
#define ISC_INTDIS_HISDONE_Msk                (_UINT32_(0x1) << ISC_INTDIS_HISDONE_Pos)            /* (ISC_INTDIS) Histogram Completed Interrupt Disable Mask */
#define ISC_INTDIS_HISDONE(value)             (ISC_INTDIS_HISDONE_Msk & (_UINT32_(value) << ISC_INTDIS_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTDIS register */
#define ISC_INTDIS_HISCLR_Pos                 _UINT32_(13)                                         /* (ISC_INTDIS) Histogram Clear Interrupt Disable Position */
#define ISC_INTDIS_HISCLR_Msk                 (_UINT32_(0x1) << ISC_INTDIS_HISCLR_Pos)             /* (ISC_INTDIS) Histogram Clear Interrupt Disable Mask */
#define ISC_INTDIS_HISCLR(value)              (ISC_INTDIS_HISCLR_Msk & (_UINT32_(value) << ISC_INTDIS_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTDIS register */
#define ISC_INTDIS_WERR_Pos                   _UINT32_(16)                                         /* (ISC_INTDIS) Write Channel Error Interrupt Disable Position */
#define ISC_INTDIS_WERR_Msk                   (_UINT32_(0x1) << ISC_INTDIS_WERR_Pos)               /* (ISC_INTDIS) Write Channel Error Interrupt Disable Mask */
#define ISC_INTDIS_WERR(value)                (ISC_INTDIS_WERR_Msk & (_UINT32_(value) << ISC_INTDIS_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTDIS register */
#define ISC_INTDIS_RERR_Pos                   _UINT32_(20)                                         /* (ISC_INTDIS) Read Channel Error Interrupt Disable Position */
#define ISC_INTDIS_RERR_Msk                   (_UINT32_(0x1) << ISC_INTDIS_RERR_Pos)               /* (ISC_INTDIS) Read Channel Error Interrupt Disable Mask */
#define ISC_INTDIS_RERR(value)                (ISC_INTDIS_RERR_Msk & (_UINT32_(value) << ISC_INTDIS_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTDIS register */
#define ISC_INTDIS_VFPOV_Pos                  _UINT32_(24)                                         /* (ISC_INTDIS) Vertical Front Porch Overflow Interrupt Disable Position */
#define ISC_INTDIS_VFPOV_Msk                  (_UINT32_(0x1) << ISC_INTDIS_VFPOV_Pos)              /* (ISC_INTDIS) Vertical Front Porch Overflow Interrupt Disable Mask */
#define ISC_INTDIS_VFPOV(value)               (ISC_INTDIS_VFPOV_Msk & (_UINT32_(value) << ISC_INTDIS_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTDIS register */
#define ISC_INTDIS_DAOV_Pos                   _UINT32_(25)                                         /* (ISC_INTDIS) Data Overflow Interrupt Disable Position */
#define ISC_INTDIS_DAOV_Msk                   (_UINT32_(0x1) << ISC_INTDIS_DAOV_Pos)               /* (ISC_INTDIS) Data Overflow Interrupt Disable Mask */
#define ISC_INTDIS_DAOV(value)                (ISC_INTDIS_DAOV_Msk & (_UINT32_(value) << ISC_INTDIS_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTDIS register */
#define ISC_INTDIS_VDTO_Pos                   _UINT32_(26)                                         /* (ISC_INTDIS) Vertical Synchronization Timeout Interrupt Disable Position */
#define ISC_INTDIS_VDTO_Msk                   (_UINT32_(0x1) << ISC_INTDIS_VDTO_Pos)               /* (ISC_INTDIS) Vertical Synchronization Timeout Interrupt Disable Mask */
#define ISC_INTDIS_VDTO(value)                (ISC_INTDIS_VDTO_Msk & (_UINT32_(value) << ISC_INTDIS_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTDIS register */
#define ISC_INTDIS_HDTO_Pos                   _UINT32_(27)                                         /* (ISC_INTDIS) Horizontal Synchronization Timeout Interrupt Disable Position */
#define ISC_INTDIS_HDTO_Msk                   (_UINT32_(0x1) << ISC_INTDIS_HDTO_Pos)               /* (ISC_INTDIS) Horizontal Synchronization Timeout Interrupt Disable Mask */
#define ISC_INTDIS_HDTO(value)                (ISC_INTDIS_HDTO_Msk & (_UINT32_(value) << ISC_INTDIS_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTDIS register */
#define ISC_INTDIS_CCIRERR_Pos                _UINT32_(28)                                         /* (ISC_INTDIS) CCIR Decoder Error Interrupt Disable Position */
#define ISC_INTDIS_CCIRERR_Msk                (_UINT32_(0x1) << ISC_INTDIS_CCIRERR_Pos)            /* (ISC_INTDIS) CCIR Decoder Error Interrupt Disable Mask */
#define ISC_INTDIS_CCIRERR(value)             (ISC_INTDIS_CCIRERR_Msk & (_UINT32_(value) << ISC_INTDIS_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTDIS register */
#define ISC_INTDIS_Msk                        _UINT32_(0x1F113333)                                 /* (ISC_INTDIS) Register Mask  */


