Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
/* -------- ISC_INTMASK : (ISC Offset: 0x30) ( R/ 32) Interrupt Mask Register -------- */
#define ISC_INTMASK_VD_Pos                    _UINT32_(0)                                          /* (ISC_INTMASK) Vertical Synchronization Detection Interrupt Mask Position */
#define ISC_INTMASK_VD_Msk                    (_UINT32_(0x1) << ISC_INTMASK_VD_Pos)                /* (ISC_INTMASK) Vertical Synchronization Detection Interrupt Mask Mask */
#define ISC_INTMASK_VD(value)                 (ISC_INTMASK_VD_Msk & (_UINT32_(value) << ISC_INTMASK_VD_Pos)) /* Assigment of value for VD in the ISC_INTMASK register */
#define ISC_INTMASK_HD_Pos                    _UINT32_(1)                                          /* (ISC_INTMASK) Horizontal Synchronization Detection Interrupt Mask Position */
#define ISC_INTMASK_HD_Msk                    (_UINT32_(0x1) << ISC_INTMASK_HD_Pos)                /* (ISC_INTMASK) Horizontal Synchronization Detection Interrupt Mask Mask */
#define ISC_INTMASK_HD(value)                 (ISC_INTMASK_HD_Msk & (_UINT32_(value) << ISC_INTMASK_HD_Pos)) /* Assigment of value for HD in the ISC_INTMASK register */
#define ISC_INTMASK_SWRST_Pos                 _UINT32_(4)                                          /* (ISC_INTMASK) Software Reset Completed Interrupt Mask Position */
#define ISC_INTMASK_SWRST_Msk                 (_UINT32_(0x1) << ISC_INTMASK_SWRST_Pos)             /* (ISC_INTMASK) Software Reset Completed Interrupt Mask Mask */
#define ISC_INTMASK_SWRST(value)              (ISC_INTMASK_SWRST_Msk & (_UINT32_(value) << ISC_INTMASK_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTMASK register */
#define ISC_INTMASK_DIS_Pos                   _UINT32_(5)                                          /* (ISC_INTMASK) Disable Completed Interrupt Mask Position */
#define ISC_INTMASK_DIS_Msk                   (_UINT32_(0x1) << ISC_INTMASK_DIS_Pos)               /* (ISC_INTMASK) Disable Completed Interrupt Mask Mask */
#define ISC_INTMASK_DIS(value)                (ISC_INTMASK_DIS_Msk & (_UINT32_(value) << ISC_INTMASK_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTMASK register */
#define ISC_INTMASK_DDONE_Pos                 _UINT32_(8)                                          /* (ISC_INTMASK) DMA Done Interrupt Mask Position */
#define ISC_INTMASK_DDONE_Msk                 (_UINT32_(0x1) << ISC_INTMASK_DDONE_Pos)             /* (ISC_INTMASK) DMA Done Interrupt Mask Mask */
#define ISC_INTMASK_DDONE(value)              (ISC_INTMASK_DDONE_Msk & (_UINT32_(value) << ISC_INTMASK_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTMASK register */
#define ISC_INTMASK_LDONE_Pos                 _UINT32_(9)                                          /* (ISC_INTMASK) DMA List Done Interrupt Mask Position */
#define ISC_INTMASK_LDONE_Msk                 (_UINT32_(0x1) << ISC_INTMASK_LDONE_Pos)             /* (ISC_INTMASK) DMA List Done Interrupt Mask Mask */
#define ISC_INTMASK_LDONE(value)              (ISC_INTMASK_LDONE_Msk & (_UINT32_(value) << ISC_INTMASK_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTMASK register */
#define ISC_INTMASK_HISDONE_Pos               _UINT32_(12)                                         /* (ISC_INTMASK) Histogram Completed Interrupt Mask Position */
#define ISC_INTMASK_HISDONE_Msk               (_UINT32_(0x1) << ISC_INTMASK_HISDONE_Pos)           /* (ISC_INTMASK) Histogram Completed Interrupt Mask Mask */
#define ISC_INTMASK_HISDONE(value)            (ISC_INTMASK_HISDONE_Msk & (_UINT32_(value) << ISC_INTMASK_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTMASK register */
#define ISC_INTMASK_HISCLR_Pos                _UINT32_(13)                                         /* (ISC_INTMASK) Histogram Clear Interrupt Mask Position */
#define ISC_INTMASK_HISCLR_Msk                (_UINT32_(0x1) << ISC_INTMASK_HISCLR_Pos)            /* (ISC_INTMASK) Histogram Clear Interrupt Mask Mask */
#define ISC_INTMASK_HISCLR(value)             (ISC_INTMASK_HISCLR_Msk & (_UINT32_(value) << ISC_INTMASK_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTMASK register */
#define ISC_INTMASK_WERR_Pos                  _UINT32_(16)                                         /* (ISC_INTMASK) Write Channel Error Interrupt Mask Position */
#define ISC_INTMASK_WERR_Msk                  (_UINT32_(0x1) << ISC_INTMASK_WERR_Pos)              /* (ISC_INTMASK) Write Channel Error Interrupt Mask Mask */
#define ISC_INTMASK_WERR(value)               (ISC_INTMASK_WERR_Msk & (_UINT32_(value) << ISC_INTMASK_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTMASK register */
#define ISC_INTMASK_RERR_Pos                  _UINT32_(20)                                         /* (ISC_INTMASK) Read Channel Error Interrupt Mask Position */
#define ISC_INTMASK_RERR_Msk                  (_UINT32_(0x1) << ISC_INTMASK_RERR_Pos)              /* (ISC_INTMASK) Read Channel Error Interrupt Mask Mask */
#define ISC_INTMASK_RERR(value)               (ISC_INTMASK_RERR_Msk & (_UINT32_(value) << ISC_INTMASK_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTMASK register */
#define ISC_INTMASK_VFPOV_Pos                 _UINT32_(24)                                         /* (ISC_INTMASK) Vertical Front Porch Overflow Interrupt Mask Position */
#define ISC_INTMASK_VFPOV_Msk                 (_UINT32_(0x1) << ISC_INTMASK_VFPOV_Pos)             /* (ISC_INTMASK) Vertical Front Porch Overflow Interrupt Mask Mask */
#define ISC_INTMASK_VFPOV(value)              (ISC_INTMASK_VFPOV_Msk & (_UINT32_(value) << ISC_INTMASK_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTMASK register */
#define ISC_INTMASK_DAOV_Pos                  _UINT32_(25)                                         /* (ISC_INTMASK) Data Overflow Interrupt Mask Position */
#define ISC_INTMASK_DAOV_Msk                  (_UINT32_(0x1) << ISC_INTMASK_DAOV_Pos)              /* (ISC_INTMASK) Data Overflow Interrupt Mask Mask */
#define ISC_INTMASK_DAOV(value)               (ISC_INTMASK_DAOV_Msk & (_UINT32_(value) << ISC_INTMASK_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTMASK register */
#define ISC_INTMASK_VDTO_Pos                  _UINT32_(26)                                         /* (ISC_INTMASK) Vertical Synchronization Timeout Interrupt Mask Position */
#define ISC_INTMASK_VDTO_Msk                  (_UINT32_(0x1) << ISC_INTMASK_VDTO_Pos)              /* (ISC_INTMASK) Vertical Synchronization Timeout Interrupt Mask Mask */
#define ISC_INTMASK_VDTO(value)               (ISC_INTMASK_VDTO_Msk & (_UINT32_(value) << ISC_INTMASK_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTMASK register */
#define ISC_INTMASK_HDTO_Pos                  _UINT32_(27)                                         /* (ISC_INTMASK) Horizontal Synchronization Timeout Interrupt Mask Position */
#define ISC_INTMASK_HDTO_Msk                  (_UINT32_(0x1) << ISC_INTMASK_HDTO_Pos)              /* (ISC_INTMASK) Horizontal Synchronization Timeout Interrupt Mask Mask */
#define ISC_INTMASK_HDTO(value)               (ISC_INTMASK_HDTO_Msk & (_UINT32_(value) << ISC_INTMASK_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTMASK register */
#define ISC_INTMASK_CCIRERR_Pos               _UINT32_(28)                                         /* (ISC_INTMASK) CCIR Decoder Error Interrupt Mask Position */
#define ISC_INTMASK_CCIRERR_Msk               (_UINT32_(0x1) << ISC_INTMASK_CCIRERR_Pos)           /* (ISC_INTMASK) CCIR Decoder Error Interrupt Mask Mask */
#define ISC_INTMASK_CCIRERR(value)            (ISC_INTMASK_CCIRERR_Msk & (_UINT32_(value) << ISC_INTMASK_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTMASK register */
#define ISC_INTMASK_Msk                       _UINT32_(0x1F113333)                                 /* (ISC_INTMASK) Register Mask  */


/* -------- ISC_INTSR : (ISC Offset: 0x34) ( R/ 32) Interrupt Status Register -------- */
#define ISC_INTSR_VD_Pos                      _UINT32_(0)                                          /* (ISC_INTSR) Vertical Synchronization Detected Interrupt Position */
#define ISC_INTSR_VD_Msk                      (_UINT32_(0x1) << ISC_INTSR_VD_Pos)                  /* (ISC_INTSR) Vertical Synchronization Detected Interrupt Mask */
#define ISC_INTSR_VD(value)                   (ISC_INTSR_VD_Msk & (_UINT32_(value) << ISC_INTSR_VD_Pos)) /* Assigment of value for VD in the ISC_INTSR register */
#define ISC_INTSR_HD_Pos                      _UINT32_(1)                                          /* (ISC_INTSR) Horizontal Synchronization Detected Interrupt Position */
#define ISC_INTSR_HD_Msk                      (_UINT32_(0x1) << ISC_INTSR_HD_Pos)                  /* (ISC_INTSR) Horizontal Synchronization Detected Interrupt Mask */
#define ISC_INTSR_HD(value)                   (ISC_INTSR_HD_Msk & (_UINT32_(value) << ISC_INTSR_HD_Pos)) /* Assigment of value for HD in the ISC_INTSR register */
#define ISC_INTSR_SWRST_Pos                   _UINT32_(4)                                          /* (ISC_INTSR) Software Reset Completed Interrupt Position */
#define ISC_INTSR_SWRST_Msk                   (_UINT32_(0x1) << ISC_INTSR_SWRST_Pos)               /* (ISC_INTSR) Software Reset Completed Interrupt Mask */
#define ISC_INTSR_SWRST(value)                (ISC_INTSR_SWRST_Msk & (_UINT32_(value) << ISC_INTSR_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTSR register */
#define ISC_INTSR_DIS_Pos                     _UINT32_(5)                                          /* (ISC_INTSR) Disable Completed Interrupt Position */
#define ISC_INTSR_DIS_Msk                     (_UINT32_(0x1) << ISC_INTSR_DIS_Pos)                 /* (ISC_INTSR) Disable Completed Interrupt Mask */
#define ISC_INTSR_DIS(value)                  (ISC_INTSR_DIS_Msk & (_UINT32_(value) << ISC_INTSR_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTSR register */
#define ISC_INTSR_DDONE_Pos                   _UINT32_(8)                                          /* (ISC_INTSR) DMA Done Interrupt Position */
#define ISC_INTSR_DDONE_Msk                   (_UINT32_(0x1) << ISC_INTSR_DDONE_Pos)               /* (ISC_INTSR) DMA Done Interrupt Mask */
#define ISC_INTSR_DDONE(value)                (ISC_INTSR_DDONE_Msk & (_UINT32_(value) << ISC_INTSR_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTSR register */
#define ISC_INTSR_LDONE_Pos                   _UINT32_(9)                                          /* (ISC_INTSR) DMA List Done Interrupt Position */
#define ISC_INTSR_LDONE_Msk                   (_UINT32_(0x1) << ISC_INTSR_LDONE_Pos)               /* (ISC_INTSR) DMA List Done Interrupt Mask */
#define ISC_INTSR_LDONE(value)                (ISC_INTSR_LDONE_Msk & (_UINT32_(value) << ISC_INTSR_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTSR register */
#define ISC_INTSR_HISDONE_Pos                 _UINT32_(12)                                         /* (ISC_INTSR) Histogram Completed Interrupt Position */
#define ISC_INTSR_HISDONE_Msk                 (_UINT32_(0x1) << ISC_INTSR_HISDONE_Pos)             /* (ISC_INTSR) Histogram Completed Interrupt Mask */
#define ISC_INTSR_HISDONE(value)              (ISC_INTSR_HISDONE_Msk & (_UINT32_(value) << ISC_INTSR_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTSR register */
#define ISC_INTSR_HISCLR_Pos                  _UINT32_(13)                                         /* (ISC_INTSR) Histogram Clear Interrupt Position */
#define ISC_INTSR_HISCLR_Msk                  (_UINT32_(0x1) << ISC_INTSR_HISCLR_Pos)              /* (ISC_INTSR) Histogram Clear Interrupt Mask */
#define ISC_INTSR_HISCLR(value)               (ISC_INTSR_HISCLR_Msk & (_UINT32_(value) << ISC_INTSR_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTSR register */
#define ISC_INTSR_WERR_Pos                    _UINT32_(16)                                         /* (ISC_INTSR) Write Channel Error Interrupt Position */
#define ISC_INTSR_WERR_Msk                    (_UINT32_(0x1) << ISC_INTSR_WERR_Pos)                /* (ISC_INTSR) Write Channel Error Interrupt Mask */
#define ISC_INTSR_WERR(value)                 (ISC_INTSR_WERR_Msk & (_UINT32_(value) << ISC_INTSR_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTSR register */
#define ISC_INTSR_WERRID_Pos                  _UINT32_(17)                                         /* (ISC_INTSR) Write Channel Error Identifier Position */
#define ISC_INTSR_WERRID_Msk                  (_UINT32_(0x3) << ISC_INTSR_WERRID_Pos)              /* (ISC_INTSR) Write Channel Error Identifier Mask */
#define ISC_INTSR_WERRID(value)               (ISC_INTSR_WERRID_Msk & (_UINT32_(value) << ISC_INTSR_WERRID_Pos)) /* Assigment of value for WERRID in the ISC_INTSR register */
#define   ISC_INTSR_WERRID_CH0_Val            _UINT32_(0x0)                                        /* (ISC_INTSR) An error occurred for Channel 0 (RAW/RGB/Y)  */
#define   ISC_INTSR_WERRID_CH1_Val            _UINT32_(0x1)                                        /* (ISC_INTSR) An error occurred for Channel 1 (CbCr/Cb)  */
#define   ISC_INTSR_WERRID_CH2_Val            _UINT32_(0x2)                                        /* (ISC_INTSR) An error occurred for Channel 2 (Cr)  */
#define   ISC_INTSR_WERRID_WB_Val             _UINT32_(0x3)                                        /* (ISC_INTSR) Write back channel error  */
#define ISC_INTSR_WERRID_CH0                  (ISC_INTSR_WERRID_CH0_Val << ISC_INTSR_WERRID_Pos)   /* (ISC_INTSR) An error occurred for Channel 0 (RAW/RGB/Y) Position  */
#define ISC_INTSR_WERRID_CH1                  (ISC_INTSR_WERRID_CH1_Val << ISC_INTSR_WERRID_Pos)   /* (ISC_INTSR) An error occurred for Channel 1 (CbCr/Cb) Position  */
#define ISC_INTSR_WERRID_CH2                  (ISC_INTSR_WERRID_CH2_Val << ISC_INTSR_WERRID_Pos)   /* (ISC_INTSR) An error occurred for Channel 2 (Cr) Position  */
#define ISC_INTSR_WERRID_WB                   (ISC_INTSR_WERRID_WB_Val << ISC_INTSR_WERRID_Pos)    /* (ISC_INTSR) Write back channel error Position  */
#define ISC_INTSR_RERR_Pos                    _UINT32_(20)                                         /* (ISC_INTSR) Read Channel Error Interrupt Position */
#define ISC_INTSR_RERR_Msk                    (_UINT32_(0x1) << ISC_INTSR_RERR_Pos)                /* (ISC_INTSR) Read Channel Error Interrupt Mask */
#define ISC_INTSR_RERR(value)                 (ISC_INTSR_RERR_Msk & (_UINT32_(value) << ISC_INTSR_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTSR register */
#define ISC_INTSR_VFPOV_Pos                   _UINT32_(24)                                         /* (ISC_INTSR) Vertical Front Porch Overflow Interrupt Position */
#define ISC_INTSR_VFPOV_Msk                   (_UINT32_(0x1) << ISC_INTSR_VFPOV_Pos)               /* (ISC_INTSR) Vertical Front Porch Overflow Interrupt Mask */
#define ISC_INTSR_VFPOV(value)                (ISC_INTSR_VFPOV_Msk & (_UINT32_(value) << ISC_INTSR_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTSR register */
#define ISC_INTSR_DAOV_Pos                    _UINT32_(25)                                         /* (ISC_INTSR) Data Overflow Interrupt Position */
#define ISC_INTSR_DAOV_Msk                    (_UINT32_(0x1) << ISC_INTSR_DAOV_Pos)                /* (ISC_INTSR) Data Overflow Interrupt Mask */
#define ISC_INTSR_DAOV(value)                 (ISC_INTSR_DAOV_Msk & (_UINT32_(value) << ISC_INTSR_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTSR register */
#define ISC_INTSR_VDTO_Pos                    _UINT32_(26)                                         /* (ISC_INTSR) Vertical Synchronization Timeout Interrupt Position */
#define ISC_INTSR_VDTO_Msk                    (_UINT32_(0x1) << ISC_INTSR_VDTO_Pos)                /* (ISC_INTSR) Vertical Synchronization Timeout Interrupt Mask */
#define ISC_INTSR_VDTO(value)                 (ISC_INTSR_VDTO_Msk & (_UINT32_(value) << ISC_INTSR_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTSR register */
#define ISC_INTSR_HDTO_Pos                    _UINT32_(27)                                         /* (ISC_INTSR) Horizontal Synchronization Timeout Interrupt Position */
#define ISC_INTSR_HDTO_Msk                    (_UINT32_(0x1) << ISC_INTSR_HDTO_Pos)                /* (ISC_INTSR) Horizontal Synchronization Timeout Interrupt Mask */
#define ISC_INTSR_HDTO(value)                 (ISC_INTSR_HDTO_Msk & (_UINT32_(value) << ISC_INTSR_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTSR register */
#define ISC_INTSR_CCIRERR_Pos                 _UINT32_(28)                                         /* (ISC_INTSR) CCIR Decoder Error Interrupt Position */
#define ISC_INTSR_CCIRERR_Msk                 (_UINT32_(0x1) << ISC_INTSR_CCIRERR_Pos)             /* (ISC_INTSR) CCIR Decoder Error Interrupt Mask */
#define ISC_INTSR_CCIRERR(value)              (ISC_INTSR_CCIRERR_Msk & (_UINT32_(value) << ISC_INTSR_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTSR register */
#define ISC_INTSR_Msk                         _UINT32_(0x1F173333)                                 /* (ISC_INTSR) Register Mask  */


/* -------- ISC_WB_CTRL : (ISC Offset: 0x58) (R/W 32) White Balance Control Register -------- */
#define ISC_WB_CTRL_ENABLE_Pos                _UINT32_(0)                                          /* (ISC_WB_CTRL) White Balance Enable Position */
#define ISC_WB_CTRL_ENABLE_Msk                (_UINT32_(0x1) << ISC_WB_CTRL_ENABLE_Pos)            /* (ISC_WB_CTRL) White Balance Enable Mask */
#define ISC_WB_CTRL_ENABLE(value)             (ISC_WB_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_WB_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_WB_CTRL register */
#define ISC_WB_CTRL_Msk                       _UINT32_(0x00000001)                                 /* (ISC_WB_CTRL) Register Mask  */


/* -------- ISC_WB_CFG : (ISC Offset: 0x5C) (R/W 32) White Balance Configuration Register -------- */
#define ISC_WB_CFG_BAYCFG_Pos                 _UINT32_(0)                                          /* (ISC_WB_CFG) White Balance Bayer Configuration (Pixel Color Pattern) Position */
#define ISC_WB_CFG_BAYCFG_Msk                 (_UINT32_(0x3) << ISC_WB_CFG_BAYCFG_Pos)             /* (ISC_WB_CFG) White Balance Bayer Configuration (Pixel Color Pattern) Mask */
#define ISC_WB_CFG_BAYCFG(value)              (ISC_WB_CFG_BAYCFG_Msk & (_UINT32_(value) << ISC_WB_CFG_BAYCFG_Pos)) /* Assigment of value for BAYCFG in the ISC_WB_CFG register */
#define   ISC_WB_CFG_BAYCFG_GRGR_Val          _UINT32_(0x0)                                        /* (ISC_WB_CFG) Starting Row configuration is G R G R (Red Row)  */
#define   ISC_WB_CFG_BAYCFG_RGRG_Val          _UINT32_(0x1)                                        /* (ISC_WB_CFG) Starting Row configuration is R G R G (Red Row)  */
#define   ISC_WB_CFG_BAYCFG_GBGB_Val          _UINT32_(0x2)                                        /* (ISC_WB_CFG) Starting Row configuration is G B G B (Blue Row)  */
#define   ISC_WB_CFG_BAYCFG_BGBG_Val          _UINT32_(0x3)                                        /* (ISC_WB_CFG) Starting Row configuration is B G B G (Blue Row)  */
#define ISC_WB_CFG_BAYCFG_GRGR                (ISC_WB_CFG_BAYCFG_GRGR_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is G R G R (Red Row) Position  */
#define ISC_WB_CFG_BAYCFG_RGRG                (ISC_WB_CFG_BAYCFG_RGRG_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is R G R G (Red Row) Position  */
#define ISC_WB_CFG_BAYCFG_GBGB                (ISC_WB_CFG_BAYCFG_GBGB_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is G B G B (Blue Row) Position  */
#define ISC_WB_CFG_BAYCFG_BGBG                (ISC_WB_CFG_BAYCFG_BGBG_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is B G B G (Blue Row) Position  */
#define ISC_WB_CFG_Msk                        _UINT32_(0x00000003)                                 /* (ISC_WB_CFG) Register Mask  */


