Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
/* -------- ISC_WB_O_RGR : (ISC Offset: 0x60) (R/W 32) White Balance Offset for R, GR Register -------- */
#define ISC_WB_O_RGR_ROFST_Pos                _UINT32_(0)                                          /* (ISC_WB_O_RGR) Offset Red Component (signed 13 bits 1:12:0) Position */
#define ISC_WB_O_RGR_ROFST_Msk                (_UINT32_(0x1FFF) << ISC_WB_O_RGR_ROFST_Pos)         /* (ISC_WB_O_RGR) Offset Red Component (signed 13 bits 1:12:0) Mask */
#define ISC_WB_O_RGR_ROFST(value)             (ISC_WB_O_RGR_ROFST_Msk & (_UINT32_(value) << ISC_WB_O_RGR_ROFST_Pos)) /* Assigment of value for ROFST in the ISC_WB_O_RGR register */
#define ISC_WB_O_RGR_GROFST_Pos               _UINT32_(16)                                         /* (ISC_WB_O_RGR) Offset Green Component for Red Row (signed 13 bits 1:12:0) Position */
#define ISC_WB_O_RGR_GROFST_Msk               (_UINT32_(0x1FFF) << ISC_WB_O_RGR_GROFST_Pos)        /* (ISC_WB_O_RGR) Offset Green Component for Red Row (signed 13 bits 1:12:0) Mask */
#define ISC_WB_O_RGR_GROFST(value)            (ISC_WB_O_RGR_GROFST_Msk & (_UINT32_(value) << ISC_WB_O_RGR_GROFST_Pos)) /* Assigment of value for GROFST in the ISC_WB_O_RGR register */
#define ISC_WB_O_RGR_Msk                      _UINT32_(0x1FFF1FFF)                                 /* (ISC_WB_O_RGR) Register Mask  */


/* -------- ISC_WB_O_BGB : (ISC Offset: 0x64) (R/W 32) White Balance Offset for B, GB Register -------- */
#define ISC_WB_O_BGB_BOFST_Pos                _UINT32_(0)                                          /* (ISC_WB_O_BGB) Offset Blue Component (signed 13 bits, 1:12:0) Position */
#define ISC_WB_O_BGB_BOFST_Msk                (_UINT32_(0x1FFF) << ISC_WB_O_BGB_BOFST_Pos)         /* (ISC_WB_O_BGB) Offset Blue Component (signed 13 bits, 1:12:0) Mask */
#define ISC_WB_O_BGB_BOFST(value)             (ISC_WB_O_BGB_BOFST_Msk & (_UINT32_(value) << ISC_WB_O_BGB_BOFST_Pos)) /* Assigment of value for BOFST in the ISC_WB_O_BGB register */
#define ISC_WB_O_BGB_GBOFST_Pos               _UINT32_(16)                                         /* (ISC_WB_O_BGB) Offset Green Component for Blue Row (signed 13 bits, 1:12:0) Position */
#define ISC_WB_O_BGB_GBOFST_Msk               (_UINT32_(0x1FFF) << ISC_WB_O_BGB_GBOFST_Pos)        /* (ISC_WB_O_BGB) Offset Green Component for Blue Row (signed 13 bits, 1:12:0) Mask */
#define ISC_WB_O_BGB_GBOFST(value)            (ISC_WB_O_BGB_GBOFST_Msk & (_UINT32_(value) << ISC_WB_O_BGB_GBOFST_Pos)) /* Assigment of value for GBOFST in the ISC_WB_O_BGB register */
#define ISC_WB_O_BGB_Msk                      _UINT32_(0x1FFF1FFF)                                 /* (ISC_WB_O_BGB) Register Mask  */


/* -------- ISC_WB_G_RGR : (ISC Offset: 0x68) (R/W 32) White Balance Gain for R, GR Register -------- */
#define ISC_WB_G_RGR_RGAIN_Pos                _UINT32_(0)                                          /* (ISC_WB_G_RGR) Red Component Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_RGR_RGAIN_Msk                (_UINT32_(0x1FFF) << ISC_WB_G_RGR_RGAIN_Pos)         /* (ISC_WB_G_RGR) Red Component Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_RGR_RGAIN(value)             (ISC_WB_G_RGR_RGAIN_Msk & (_UINT32_(value) << ISC_WB_G_RGR_RGAIN_Pos)) /* Assigment of value for RGAIN in the ISC_WB_G_RGR register */
#define ISC_WB_G_RGR_GRGAIN_Pos               _UINT32_(16)                                         /* (ISC_WB_G_RGR) Green Component (Red row) Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_RGR_GRGAIN_Msk               (_UINT32_(0x1FFF) << ISC_WB_G_RGR_GRGAIN_Pos)        /* (ISC_WB_G_RGR) Green Component (Red row) Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_RGR_GRGAIN(value)            (ISC_WB_G_RGR_GRGAIN_Msk & (_UINT32_(value) << ISC_WB_G_RGR_GRGAIN_Pos)) /* Assigment of value for GRGAIN in the ISC_WB_G_RGR register */
#define ISC_WB_G_RGR_Msk                      _UINT32_(0x1FFF1FFF)                                 /* (ISC_WB_G_RGR) Register Mask  */


/* -------- ISC_WB_G_BGB : (ISC Offset: 0x6C) (R/W 32) White Balance Gain for B, GB Register -------- */
#define ISC_WB_G_BGB_BGAIN_Pos                _UINT32_(0)                                          /* (ISC_WB_G_BGB) Blue Component Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_BGB_BGAIN_Msk                (_UINT32_(0x1FFF) << ISC_WB_G_BGB_BGAIN_Pos)         /* (ISC_WB_G_BGB) Blue Component Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_BGB_BGAIN(value)             (ISC_WB_G_BGB_BGAIN_Msk & (_UINT32_(value) << ISC_WB_G_BGB_BGAIN_Pos)) /* Assigment of value for BGAIN in the ISC_WB_G_BGB register */
#define ISC_WB_G_BGB_GBGAIN_Pos               _UINT32_(16)                                         /* (ISC_WB_G_BGB) Green Component (Blue row) Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_BGB_GBGAIN_Msk               (_UINT32_(0x1FFF) << ISC_WB_G_BGB_GBGAIN_Pos)        /* (ISC_WB_G_BGB) Green Component (Blue row) Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_BGB_GBGAIN(value)            (ISC_WB_G_BGB_GBGAIN_Msk & (_UINT32_(value) << ISC_WB_G_BGB_GBGAIN_Pos)) /* Assigment of value for GBGAIN in the ISC_WB_G_BGB register */
#define ISC_WB_G_BGB_Msk                      _UINT32_(0x1FFF1FFF)                                 /* (ISC_WB_G_BGB) Register Mask  */


/* -------- ISC_CFA_CTRL : (ISC Offset: 0x70) (R/W 32) Color Filter Array Control Register -------- */
#define ISC_CFA_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_CFA_CTRL) Color Filter Array Interpolation Enable Position */
#define ISC_CFA_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_CFA_CTRL_ENABLE_Pos)           /* (ISC_CFA_CTRL) Color Filter Array Interpolation Enable Mask */
#define ISC_CFA_CTRL_ENABLE(value)            (ISC_CFA_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CFA_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CFA_CTRL register */
#define ISC_CFA_CTRL_Msk                      _UINT32_(0x00000001)                                 /* (ISC_CFA_CTRL) Register Mask  */


/* -------- ISC_CFA_CFG : (ISC Offset: 0x74) (R/W 32) Color Filter Array Configuration Register -------- */
#define ISC_CFA_CFG_BAYCFG_Pos                _UINT32_(0)                                          /* (ISC_CFA_CFG) Color Filter Array Pattern Position */
#define ISC_CFA_CFG_BAYCFG_Msk                (_UINT32_(0x3) << ISC_CFA_CFG_BAYCFG_Pos)            /* (ISC_CFA_CFG) Color Filter Array Pattern Mask */
#define ISC_CFA_CFG_BAYCFG(value)             (ISC_CFA_CFG_BAYCFG_Msk & (_UINT32_(value) << ISC_CFA_CFG_BAYCFG_Pos)) /* Assigment of value for BAYCFG in the ISC_CFA_CFG register */
#define   ISC_CFA_CFG_BAYCFG_GRGR_Val         _UINT32_(0x0)                                        /* (ISC_CFA_CFG) Starting row configuration is G R G R (red row)  */
#define   ISC_CFA_CFG_BAYCFG_RGRG_Val         _UINT32_(0x1)                                        /* (ISC_CFA_CFG) Starting row configuration is R G R G (red row  */
#define   ISC_CFA_CFG_BAYCFG_GBGB_Val         _UINT32_(0x2)                                        /* (ISC_CFA_CFG) Starting row configuration is G B G B (blue row)  */
#define   ISC_CFA_CFG_BAYCFG_BGBG_Val         _UINT32_(0x3)                                        /* (ISC_CFA_CFG) Starting row configuration is B G B G (blue row)  */
#define ISC_CFA_CFG_BAYCFG_GRGR               (ISC_CFA_CFG_BAYCFG_GRGR_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is G R G R (red row) Position  */
#define ISC_CFA_CFG_BAYCFG_RGRG               (ISC_CFA_CFG_BAYCFG_RGRG_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is R G R G (red row Position  */
#define ISC_CFA_CFG_BAYCFG_GBGB               (ISC_CFA_CFG_BAYCFG_GBGB_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is G B G B (blue row) Position  */
#define ISC_CFA_CFG_BAYCFG_BGBG               (ISC_CFA_CFG_BAYCFG_BGBG_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is B G B G (blue row) Position  */
#define ISC_CFA_CFG_EITPOL_Pos                _UINT32_(4)                                          /* (ISC_CFA_CFG) Edge Interpolation Position */
#define ISC_CFA_CFG_EITPOL_Msk                (_UINT32_(0x1) << ISC_CFA_CFG_EITPOL_Pos)            /* (ISC_CFA_CFG) Edge Interpolation Mask */
#define ISC_CFA_CFG_EITPOL(value)             (ISC_CFA_CFG_EITPOL_Msk & (_UINT32_(value) << ISC_CFA_CFG_EITPOL_Pos)) /* Assigment of value for EITPOL in the ISC_CFA_CFG register */
#define ISC_CFA_CFG_Msk                       _UINT32_(0x00000013)                                 /* (ISC_CFA_CFG) Register Mask  */


/* -------- ISC_CC_CTRL : (ISC Offset: 0x78) (R/W 32) Color Correction Control Register -------- */
#define ISC_CC_CTRL_ENABLE_Pos                _UINT32_(0)                                          /* (ISC_CC_CTRL) Color Correction Enable Position */
#define ISC_CC_CTRL_ENABLE_Msk                (_UINT32_(0x1) << ISC_CC_CTRL_ENABLE_Pos)            /* (ISC_CC_CTRL) Color Correction Enable Mask */
#define ISC_CC_CTRL_ENABLE(value)             (ISC_CC_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CC_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CC_CTRL register */
#define ISC_CC_CTRL_Msk                       _UINT32_(0x00000001)                                 /* (ISC_CC_CTRL) Register Mask  */


