Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
/* -------- ISC_CC_RR_RG : (ISC Offset: 0x7C) (R/W 32) Color Correction RR RG Register -------- */
#define ISC_CC_RR_RG_RRGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_RR_RG) Red Gain for Red Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_RR_RG_RRGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_RR_RG_RRGAIN_Pos)         /* (ISC_CC_RR_RG) Red Gain for Red Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_RR_RG_RRGAIN(value)            (ISC_CC_RR_RG_RRGAIN_Msk & (_UINT32_(value) << ISC_CC_RR_RG_RRGAIN_Pos)) /* Assigment of value for RRGAIN in the ISC_CC_RR_RG register */
#define ISC_CC_RR_RG_RGGAIN_Pos               _UINT32_(16)                                         /* (ISC_CC_RR_RG) Green Gain for Red Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_RR_RG_RGGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_RR_RG_RGGAIN_Pos)         /* (ISC_CC_RR_RG) Green Gain for Red Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_RR_RG_RGGAIN(value)            (ISC_CC_RR_RG_RGGAIN_Msk & (_UINT32_(value) << ISC_CC_RR_RG_RGGAIN_Pos)) /* Assigment of value for RGGAIN in the ISC_CC_RR_RG register */
#define ISC_CC_RR_RG_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (ISC_CC_RR_RG) Register Mask  */


/* -------- ISC_CC_RB_OR : (ISC Offset: 0x80) (R/W 32) Color Correction RB OR Register -------- */
#define ISC_CC_RB_OR_RBGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_RB_OR) Blue Gain for Red Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_RB_OR_RBGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_RB_OR_RBGAIN_Pos)         /* (ISC_CC_RB_OR) Blue Gain for Red Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_RB_OR_RBGAIN(value)            (ISC_CC_RB_OR_RBGAIN_Msk & (_UINT32_(value) << ISC_CC_RB_OR_RBGAIN_Pos)) /* Assigment of value for RBGAIN in the ISC_CC_RB_OR register */
#define ISC_CC_RB_OR_ROFST_Pos                _UINT32_(16)                                         /* (ISC_CC_RB_OR) Red Component Offset (signed 13 bits, 1:12:0) Position */
#define ISC_CC_RB_OR_ROFST_Msk                (_UINT32_(0x1FFF) << ISC_CC_RB_OR_ROFST_Pos)         /* (ISC_CC_RB_OR) Red Component Offset (signed 13 bits, 1:12:0) Mask */
#define ISC_CC_RB_OR_ROFST(value)             (ISC_CC_RB_OR_ROFST_Msk & (_UINT32_(value) << ISC_CC_RB_OR_ROFST_Pos)) /* Assigment of value for ROFST in the ISC_CC_RB_OR register */
#define ISC_CC_RB_OR_Msk                      _UINT32_(0x1FFF0FFF)                                 /* (ISC_CC_RB_OR) Register Mask  */


/* -------- ISC_CC_GR_GG : (ISC Offset: 0x84) (R/W 32) Color Correction GR GG Register -------- */
#define ISC_CC_GR_GG_GRGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_GR_GG) Red Gain for Green Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_GR_GG_GRGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_GR_GG_GRGAIN_Pos)         /* (ISC_CC_GR_GG) Red Gain for Green Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_GR_GG_GRGAIN(value)            (ISC_CC_GR_GG_GRGAIN_Msk & (_UINT32_(value) << ISC_CC_GR_GG_GRGAIN_Pos)) /* Assigment of value for GRGAIN in the ISC_CC_GR_GG register */
#define ISC_CC_GR_GG_GGGAIN_Pos               _UINT32_(16)                                         /* (ISC_CC_GR_GG) Green Gain for Green Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_GR_GG_GGGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_GR_GG_GGGAIN_Pos)         /* (ISC_CC_GR_GG) Green Gain for Green Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_GR_GG_GGGAIN(value)            (ISC_CC_GR_GG_GGGAIN_Msk & (_UINT32_(value) << ISC_CC_GR_GG_GGGAIN_Pos)) /* Assigment of value for GGGAIN in the ISC_CC_GR_GG register */
#define ISC_CC_GR_GG_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (ISC_CC_GR_GG) Register Mask  */


/* -------- ISC_CC_GB_OG : (ISC Offset: 0x88) (R/W 32) Color Correction GB OG Register -------- */
#define ISC_CC_GB_OG_GBGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_GB_OG) Blue Gain for Green Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_GB_OG_GBGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_GB_OG_GBGAIN_Pos)         /* (ISC_CC_GB_OG) Blue Gain for Green Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_GB_OG_GBGAIN(value)            (ISC_CC_GB_OG_GBGAIN_Msk & (_UINT32_(value) << ISC_CC_GB_OG_GBGAIN_Pos)) /* Assigment of value for GBGAIN in the ISC_CC_GB_OG register */
#define ISC_CC_GB_OG_ROFST_Pos                _UINT32_(16)                                         /* (ISC_CC_GB_OG) Green Component Offset (signed 13 bits, 1:12:0) Position */
#define ISC_CC_GB_OG_ROFST_Msk                (_UINT32_(0x1FFF) << ISC_CC_GB_OG_ROFST_Pos)         /* (ISC_CC_GB_OG) Green Component Offset (signed 13 bits, 1:12:0) Mask */
#define ISC_CC_GB_OG_ROFST(value)             (ISC_CC_GB_OG_ROFST_Msk & (_UINT32_(value) << ISC_CC_GB_OG_ROFST_Pos)) /* Assigment of value for ROFST in the ISC_CC_GB_OG register */
#define ISC_CC_GB_OG_Msk                      _UINT32_(0x1FFF0FFF)                                 /* (ISC_CC_GB_OG) Register Mask  */


/* -------- ISC_CC_BR_BG : (ISC Offset: 0x8C) (R/W 32) Color Correction BR BG Register -------- */
#define ISC_CC_BR_BG_BRGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_BR_BG) Red Gain for Blue Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_BR_BG_BRGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_BR_BG_BRGAIN_Pos)         /* (ISC_CC_BR_BG) Red Gain for Blue Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_BR_BG_BRGAIN(value)            (ISC_CC_BR_BG_BRGAIN_Msk & (_UINT32_(value) << ISC_CC_BR_BG_BRGAIN_Pos)) /* Assigment of value for BRGAIN in the ISC_CC_BR_BG register */
#define ISC_CC_BR_BG_BGGAIN_Pos               _UINT32_(16)                                         /* (ISC_CC_BR_BG) Green Gain for Blue Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_BR_BG_BGGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_BR_BG_BGGAIN_Pos)         /* (ISC_CC_BR_BG) Green Gain for Blue Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_BR_BG_BGGAIN(value)            (ISC_CC_BR_BG_BGGAIN_Msk & (_UINT32_(value) << ISC_CC_BR_BG_BGGAIN_Pos)) /* Assigment of value for BGGAIN in the ISC_CC_BR_BG register */
#define ISC_CC_BR_BG_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (ISC_CC_BR_BG) Register Mask  */


/* -------- ISC_CC_BB_OB : (ISC Offset: 0x90) (R/W 32) Color Correction BB OB Register -------- */
#define ISC_CC_BB_OB_BBGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_BB_OB) Blue Gain for Blue Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_BB_OB_BBGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_BB_OB_BBGAIN_Pos)         /* (ISC_CC_BB_OB) Blue Gain for Blue Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_BB_OB_BBGAIN(value)            (ISC_CC_BB_OB_BBGAIN_Msk & (_UINT32_(value) << ISC_CC_BB_OB_BBGAIN_Pos)) /* Assigment of value for BBGAIN in the ISC_CC_BB_OB register */
#define ISC_CC_BB_OB_BOFST_Pos                _UINT32_(16)                                         /* (ISC_CC_BB_OB) Blue Component Offset (signed 13 bits, 1:12:0) Position */
#define ISC_CC_BB_OB_BOFST_Msk                (_UINT32_(0x1FFF) << ISC_CC_BB_OB_BOFST_Pos)         /* (ISC_CC_BB_OB) Blue Component Offset (signed 13 bits, 1:12:0) Mask */
#define ISC_CC_BB_OB_BOFST(value)             (ISC_CC_BB_OB_BOFST_Msk & (_UINT32_(value) << ISC_CC_BB_OB_BOFST_Pos)) /* Assigment of value for BOFST in the ISC_CC_BB_OB register */
#define ISC_CC_BB_OB_Msk                      _UINT32_(0x1FFF0FFF)                                 /* (ISC_CC_BB_OB) Register Mask  */


/* -------- ISC_GAM_CTRL : (ISC Offset: 0x94) (R/W 32) Gamma Correction Control Register -------- */
#define ISC_GAM_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable Position */
#define ISC_GAM_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_GAM_CTRL_ENABLE_Pos)           /* (ISC_GAM_CTRL) Gamma Correction Enable Mask */
#define ISC_GAM_CTRL_ENABLE(value)            (ISC_GAM_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_BENABLE_Pos              _UINT32_(1)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable for B Channel Position */
#define ISC_GAM_CTRL_BENABLE_Msk              (_UINT32_(0x1) << ISC_GAM_CTRL_BENABLE_Pos)          /* (ISC_GAM_CTRL) Gamma Correction Enable for B Channel Mask */
#define ISC_GAM_CTRL_BENABLE(value)           (ISC_GAM_CTRL_BENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_BENABLE_Pos)) /* Assigment of value for BENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_GENABLE_Pos              _UINT32_(2)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable for G Channel Position */
#define ISC_GAM_CTRL_GENABLE_Msk              (_UINT32_(0x1) << ISC_GAM_CTRL_GENABLE_Pos)          /* (ISC_GAM_CTRL) Gamma Correction Enable for G Channel Mask */
#define ISC_GAM_CTRL_GENABLE(value)           (ISC_GAM_CTRL_GENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_GENABLE_Pos)) /* Assigment of value for GENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_RENABLE_Pos              _UINT32_(3)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable for R Channel Position */
#define ISC_GAM_CTRL_RENABLE_Msk              (_UINT32_(0x1) << ISC_GAM_CTRL_RENABLE_Pos)          /* (ISC_GAM_CTRL) Gamma Correction Enable for R Channel Mask */
#define ISC_GAM_CTRL_RENABLE(value)           (ISC_GAM_CTRL_RENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_RENABLE_Pos)) /* Assigment of value for RENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_Msk                      _UINT32_(0x0000000F)                                 /* (ISC_GAM_CTRL) Register Mask  */


/* -------- ISC_GAM_BENTRY : (ISC Offset: 0x98) (R/W 32) Gamma Correction Blue Entry -------- */
#define ISC_GAM_BENTRY_BSLOPE_Pos             _UINT32_(0)                                          /* (ISC_GAM_BENTRY) Blue Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Position */
#define ISC_GAM_BENTRY_BSLOPE_Msk             (_UINT32_(0x3FF) << ISC_GAM_BENTRY_BSLOPE_Pos)       /* (ISC_GAM_BENTRY) Blue Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Mask */
#define ISC_GAM_BENTRY_BSLOPE(value)          (ISC_GAM_BENTRY_BSLOPE_Msk & (_UINT32_(value) << ISC_GAM_BENTRY_BSLOPE_Pos)) /* Assigment of value for BSLOPE in the ISC_GAM_BENTRY register */
#define ISC_GAM_BENTRY_BCONSTANT_Pos          _UINT32_(16)                                         /* (ISC_GAM_BENTRY) Blue Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Position */
#define ISC_GAM_BENTRY_BCONSTANT_Msk          (_UINT32_(0x3FF) << ISC_GAM_BENTRY_BCONSTANT_Pos)    /* (ISC_GAM_BENTRY) Blue Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Mask */
#define ISC_GAM_BENTRY_BCONSTANT(value)       (ISC_GAM_BENTRY_BCONSTANT_Msk & (_UINT32_(value) << ISC_GAM_BENTRY_BCONSTANT_Pos)) /* Assigment of value for BCONSTANT in the ISC_GAM_BENTRY register */
#define ISC_GAM_BENTRY_Msk                    _UINT32_(0x03FF03FF)                                 /* (ISC_GAM_BENTRY) Register Mask  */


/* -------- ISC_GAM_GENTRY : (ISC Offset: 0x198) (R/W 32) Gamma Correction Green Entry -------- */
#define ISC_GAM_GENTRY_GSLOPE_Pos             _UINT32_(0)                                          /* (ISC_GAM_GENTRY) Green Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Position */
#define ISC_GAM_GENTRY_GSLOPE_Msk             (_UINT32_(0x3FF) << ISC_GAM_GENTRY_GSLOPE_Pos)       /* (ISC_GAM_GENTRY) Green Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Mask */
#define ISC_GAM_GENTRY_GSLOPE(value)          (ISC_GAM_GENTRY_GSLOPE_Msk & (_UINT32_(value) << ISC_GAM_GENTRY_GSLOPE_Pos)) /* Assigment of value for GSLOPE in the ISC_GAM_GENTRY register */
#define ISC_GAM_GENTRY_GCONSTANT_Pos          _UINT32_(16)                                         /* (ISC_GAM_GENTRY) Green Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Position */
#define ISC_GAM_GENTRY_GCONSTANT_Msk          (_UINT32_(0x3FF) << ISC_GAM_GENTRY_GCONSTANT_Pos)    /* (ISC_GAM_GENTRY) Green Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Mask */
#define ISC_GAM_GENTRY_GCONSTANT(value)       (ISC_GAM_GENTRY_GCONSTANT_Msk & (_UINT32_(value) << ISC_GAM_GENTRY_GCONSTANT_Pos)) /* Assigment of value for GCONSTANT in the ISC_GAM_GENTRY register */
#define ISC_GAM_GENTRY_Msk                    _UINT32_(0x03FF03FF)                                 /* (ISC_GAM_GENTRY) Register Mask  */


/* -------- ISC_GAM_RENTRY : (ISC Offset: 0x298) (R/W 32) Gamma Correction Red Entry -------- */
#define ISC_GAM_RENTRY_RSLOPE_Pos             _UINT32_(0)                                          /* (ISC_GAM_RENTRY) Red Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Position */
#define ISC_GAM_RENTRY_RSLOPE_Msk             (_UINT32_(0x3FF) << ISC_GAM_RENTRY_RSLOPE_Pos)       /* (ISC_GAM_RENTRY) Red Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Mask */
#define ISC_GAM_RENTRY_RSLOPE(value)          (ISC_GAM_RENTRY_RSLOPE_Msk & (_UINT32_(value) << ISC_GAM_RENTRY_RSLOPE_Pos)) /* Assigment of value for RSLOPE in the ISC_GAM_RENTRY register */
#define ISC_GAM_RENTRY_RCONSTANT_Pos          _UINT32_(16)                                         /* (ISC_GAM_RENTRY) Red Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Position */
#define ISC_GAM_RENTRY_RCONSTANT_Msk          (_UINT32_(0x3FF) << ISC_GAM_RENTRY_RCONSTANT_Pos)    /* (ISC_GAM_RENTRY) Red Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Mask */
#define ISC_GAM_RENTRY_RCONSTANT(value)       (ISC_GAM_RENTRY_RCONSTANT_Msk & (_UINT32_(value) << ISC_GAM_RENTRY_RCONSTANT_Pos)) /* Assigment of value for RCONSTANT in the ISC_GAM_RENTRY register */
#define ISC_GAM_RENTRY_Msk                    _UINT32_(0x03FF03FF)                                 /* (ISC_GAM_RENTRY) Register Mask  */


