Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
/* -------- ISC_CSC_CTRL : (ISC Offset: 0x398) (R/W 32) Color Space Conversion Control Register -------- */
#define ISC_CSC_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_CSC_CTRL) RGB to YCbCr Color Space Conversion Enable Position */
#define ISC_CSC_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_CSC_CTRL_ENABLE_Pos)           /* (ISC_CSC_CTRL) RGB to YCbCr Color Space Conversion Enable Mask */
#define ISC_CSC_CTRL_ENABLE(value)            (ISC_CSC_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CSC_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CSC_CTRL register */
#define ISC_CSC_CTRL_Msk                      _UINT32_(0x00000001)                                 /* (ISC_CSC_CTRL) Register Mask  */


/* -------- ISC_CSC_YR_YG : (ISC Offset: 0x39C) (R/W 32) Color Space Conversion YR, YG Register -------- */
#define ISC_CSC_YR_YG_YRGAIN_Pos              _UINT32_(0)                                          /* (ISC_CSC_YR_YG) Reg Gain for Luminance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_YR_YG_YRGAIN_Msk              (_UINT32_(0xFFF) << ISC_CSC_YR_YG_YRGAIN_Pos)        /* (ISC_CSC_YR_YG) Reg Gain for Luminance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_YR_YG_YRGAIN(value)           (ISC_CSC_YR_YG_YRGAIN_Msk & (_UINT32_(value) << ISC_CSC_YR_YG_YRGAIN_Pos)) /* Assigment of value for YRGAIN in the ISC_CSC_YR_YG register */
#define ISC_CSC_YR_YG_YGGAIN_Pos              _UINT32_(16)                                         /* (ISC_CSC_YR_YG) Green Gain for Luminance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_YR_YG_YGGAIN_Msk              (_UINT32_(0xFFF) << ISC_CSC_YR_YG_YGGAIN_Pos)        /* (ISC_CSC_YR_YG) Green Gain for Luminance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_YR_YG_YGGAIN(value)           (ISC_CSC_YR_YG_YGGAIN_Msk & (_UINT32_(value) << ISC_CSC_YR_YG_YGGAIN_Pos)) /* Assigment of value for YGGAIN in the ISC_CSC_YR_YG register */
#define ISC_CSC_YR_YG_Msk                     _UINT32_(0x0FFF0FFF)                                 /* (ISC_CSC_YR_YG) Register Mask  */


/* -------- ISC_CSC_YB_OY : (ISC Offset: 0x3A0) (R/W 32) Color Space Conversion YB, OY Register -------- */
#define ISC_CSC_YB_OY_YBGAIN_Pos              _UINT32_(0)                                          /* (ISC_CSC_YB_OY) Blue Gain for Luminance Component (12 bits signed 1:3:8) Position */
#define ISC_CSC_YB_OY_YBGAIN_Msk              (_UINT32_(0xFFF) << ISC_CSC_YB_OY_YBGAIN_Pos)        /* (ISC_CSC_YB_OY) Blue Gain for Luminance Component (12 bits signed 1:3:8) Mask */
#define ISC_CSC_YB_OY_YBGAIN(value)           (ISC_CSC_YB_OY_YBGAIN_Msk & (_UINT32_(value) << ISC_CSC_YB_OY_YBGAIN_Pos)) /* Assigment of value for YBGAIN in the ISC_CSC_YB_OY register */
#define ISC_CSC_YB_OY_YOFST_Pos               _UINT32_(16)                                         /* (ISC_CSC_YB_OY) Luminance Offset (11 bits signed 1:10:0) Position */
#define ISC_CSC_YB_OY_YOFST_Msk               (_UINT32_(0x7FF) << ISC_CSC_YB_OY_YOFST_Pos)         /* (ISC_CSC_YB_OY) Luminance Offset (11 bits signed 1:10:0) Mask */
#define ISC_CSC_YB_OY_YOFST(value)            (ISC_CSC_YB_OY_YOFST_Msk & (_UINT32_(value) << ISC_CSC_YB_OY_YOFST_Pos)) /* Assigment of value for YOFST in the ISC_CSC_YB_OY register */
#define ISC_CSC_YB_OY_Msk                     _UINT32_(0x07FF0FFF)                                 /* (ISC_CSC_YB_OY) Register Mask  */


/* -------- ISC_CSC_CBR_CBG : (ISC Offset: 0x3A4) (R/W 32) Color Space Conversion CBR CBG Register -------- */
#define ISC_CSC_CBR_CBG_CBRGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CBR_CBG) Red Gain for Blue Chrominance (signed 12 bits, 1:3:8) Position */
#define ISC_CSC_CBR_CBG_CBRGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CBR_CBG_CBRGAIN_Pos)     /* (ISC_CSC_CBR_CBG) Red Gain for Blue Chrominance (signed 12 bits, 1:3:8) Mask */
#define ISC_CSC_CBR_CBG_CBRGAIN(value)        (ISC_CSC_CBR_CBG_CBRGAIN_Msk & (_UINT32_(value) << ISC_CSC_CBR_CBG_CBRGAIN_Pos)) /* Assigment of value for CBRGAIN in the ISC_CSC_CBR_CBG register */
#define ISC_CSC_CBR_CBG_CBGGAIN_Pos           _UINT32_(16)                                         /* (ISC_CSC_CBR_CBG) Green Gain for Blue Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CBR_CBG_CBGGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CBR_CBG_CBGGAIN_Pos)     /* (ISC_CSC_CBR_CBG) Green Gain for Blue Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CBR_CBG_CBGGAIN(value)        (ISC_CSC_CBR_CBG_CBGGAIN_Msk & (_UINT32_(value) << ISC_CSC_CBR_CBG_CBGGAIN_Pos)) /* Assigment of value for CBGGAIN in the ISC_CSC_CBR_CBG register */
#define ISC_CSC_CBR_CBG_Msk                   _UINT32_(0x0FFF0FFF)                                 /* (ISC_CSC_CBR_CBG) Register Mask  */


/* -------- ISC_CSC_CBB_OCB : (ISC Offset: 0x3A8) (R/W 32) Color Space Conversion CBB OCB Register -------- */
#define ISC_CSC_CBB_OCB_CBBGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CBB_OCB) Blue Gain for Blue Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CBB_OCB_CBBGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CBB_OCB_CBBGAIN_Pos)     /* (ISC_CSC_CBB_OCB) Blue Gain for Blue Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CBB_OCB_CBBGAIN(value)        (ISC_CSC_CBB_OCB_CBBGAIN_Msk & (_UINT32_(value) << ISC_CSC_CBB_OCB_CBBGAIN_Pos)) /* Assigment of value for CBBGAIN in the ISC_CSC_CBB_OCB register */
#define ISC_CSC_CBB_OCB_CBOFST_Pos            _UINT32_(16)                                         /* (ISC_CSC_CBB_OCB) Blue Chrominance Offset (signed 11 bits 1:10:0) Position */
#define ISC_CSC_CBB_OCB_CBOFST_Msk            (_UINT32_(0x7FF) << ISC_CSC_CBB_OCB_CBOFST_Pos)      /* (ISC_CSC_CBB_OCB) Blue Chrominance Offset (signed 11 bits 1:10:0) Mask */
#define ISC_CSC_CBB_OCB_CBOFST(value)         (ISC_CSC_CBB_OCB_CBOFST_Msk & (_UINT32_(value) << ISC_CSC_CBB_OCB_CBOFST_Pos)) /* Assigment of value for CBOFST in the ISC_CSC_CBB_OCB register */
#define ISC_CSC_CBB_OCB_Msk                   _UINT32_(0x07FF0FFF)                                 /* (ISC_CSC_CBB_OCB) Register Mask  */


/* -------- ISC_CSC_CRR_CRG : (ISC Offset: 0x3AC) (R/W 32) Color Space Conversion CRR CRG Register -------- */
#define ISC_CSC_CRR_CRG_CRRGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CRR_CRG) Red Gain for Red Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CRR_CRG_CRRGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CRR_CRG_CRRGAIN_Pos)     /* (ISC_CSC_CRR_CRG) Red Gain for Red Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CRR_CRG_CRRGAIN(value)        (ISC_CSC_CRR_CRG_CRRGAIN_Msk & (_UINT32_(value) << ISC_CSC_CRR_CRG_CRRGAIN_Pos)) /* Assigment of value for CRRGAIN in the ISC_CSC_CRR_CRG register */
#define ISC_CSC_CRR_CRG_CRGGAIN_Pos           _UINT32_(16)                                         /* (ISC_CSC_CRR_CRG) Green Gain for Red Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CRR_CRG_CRGGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CRR_CRG_CRGGAIN_Pos)     /* (ISC_CSC_CRR_CRG) Green Gain for Red Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CRR_CRG_CRGGAIN(value)        (ISC_CSC_CRR_CRG_CRGGAIN_Msk & (_UINT32_(value) << ISC_CSC_CRR_CRG_CRGGAIN_Pos)) /* Assigment of value for CRGGAIN in the ISC_CSC_CRR_CRG register */
#define ISC_CSC_CRR_CRG_Msk                   _UINT32_(0x0FFF0FFF)                                 /* (ISC_CSC_CRR_CRG) Register Mask  */


/* -------- ISC_CSC_CRB_OCR : (ISC Offset: 0x3B0) (R/W 32) Color Space Conversion CRB OCR Register -------- */
#define ISC_CSC_CRB_OCR_CRBGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CRB_OCR) Blue Gain for Red Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CRB_OCR_CRBGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CRB_OCR_CRBGAIN_Pos)     /* (ISC_CSC_CRB_OCR) Blue Gain for Red Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CRB_OCR_CRBGAIN(value)        (ISC_CSC_CRB_OCR_CRBGAIN_Msk & (_UINT32_(value) << ISC_CSC_CRB_OCR_CRBGAIN_Pos)) /* Assigment of value for CRBGAIN in the ISC_CSC_CRB_OCR register */
#define ISC_CSC_CRB_OCR_CROFST_Pos            _UINT32_(16)                                         /* (ISC_CSC_CRB_OCR) Red Chrominance Offset (signed 11 bits 1:10:0) Position */
#define ISC_CSC_CRB_OCR_CROFST_Msk            (_UINT32_(0x7FF) << ISC_CSC_CRB_OCR_CROFST_Pos)      /* (ISC_CSC_CRB_OCR) Red Chrominance Offset (signed 11 bits 1:10:0) Mask */
#define ISC_CSC_CRB_OCR_CROFST(value)         (ISC_CSC_CRB_OCR_CROFST_Msk & (_UINT32_(value) << ISC_CSC_CRB_OCR_CROFST_Pos)) /* Assigment of value for CROFST in the ISC_CSC_CRB_OCR register */
#define ISC_CSC_CRB_OCR_Msk                   _UINT32_(0x07FF0FFF)                                 /* (ISC_CSC_CRB_OCR) Register Mask  */


/* -------- ISC_CBC_CTRL : (ISC Offset: 0x3B4) (R/W 32) Contrast and Brightness Control Register -------- */
#define ISC_CBC_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_CBC_CTRL) Contrast and Brightness Control Enable Position */
#define ISC_CBC_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_CBC_CTRL_ENABLE_Pos)           /* (ISC_CBC_CTRL) Contrast and Brightness Control Enable Mask */
#define ISC_CBC_CTRL_ENABLE(value)            (ISC_CBC_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CBC_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CBC_CTRL register */
#define ISC_CBC_CTRL_Msk                      _UINT32_(0x00000001)                                 /* (ISC_CBC_CTRL) Register Mask  */


/* -------- ISC_CBC_CFG : (ISC Offset: 0x3B8) (R/W 32) Contrast and Brightness Configuration Register -------- */
#define ISC_CBC_CFG_CCIR_Pos                  _UINT32_(0)                                          /* (ISC_CBC_CFG) CCIR656 Stream Enable Position */
#define ISC_CBC_CFG_CCIR_Msk                  (_UINT32_(0x1) << ISC_CBC_CFG_CCIR_Pos)              /* (ISC_CBC_CFG) CCIR656 Stream Enable Mask */
#define ISC_CBC_CFG_CCIR(value)               (ISC_CBC_CFG_CCIR_Msk & (_UINT32_(value) << ISC_CBC_CFG_CCIR_Pos)) /* Assigment of value for CCIR in the ISC_CBC_CFG register */
#define ISC_CBC_CFG_CCIRMODE_Pos              _UINT32_(1)                                          /* (ISC_CBC_CFG) CCIR656 Byte Ordering Position */
#define ISC_CBC_CFG_CCIRMODE_Msk              (_UINT32_(0x3) << ISC_CBC_CFG_CCIRMODE_Pos)          /* (ISC_CBC_CFG) CCIR656 Byte Ordering Mask */
#define ISC_CBC_CFG_CCIRMODE(value)           (ISC_CBC_CFG_CCIRMODE_Msk & (_UINT32_(value) << ISC_CBC_CFG_CCIRMODE_Pos)) /* Assigment of value for CCIRMODE in the ISC_CBC_CFG register */
#define   ISC_CBC_CFG_CCIRMODE_CBY_Val        _UINT32_(0x0)                                        /* (ISC_CBC_CFG) Byte ordering Cb0, Y0, Cr0, Y1  */
#define   ISC_CBC_CFG_CCIRMODE_CRY_Val        _UINT32_(0x1)                                        /* (ISC_CBC_CFG) Byte ordering Cr0, Y0, Cb0, Y1  */
#define   ISC_CBC_CFG_CCIRMODE_YCB_Val        _UINT32_(0x2)                                        /* (ISC_CBC_CFG) Byte ordering Y0, Cb0, Y1, Cr0  */
#define   ISC_CBC_CFG_CCIRMODE_YCR_Val        _UINT32_(0x3)                                        /* (ISC_CBC_CFG) Byte ordering Y0, Cr0, Y1, Cb0  */
#define ISC_CBC_CFG_CCIRMODE_CBY              (ISC_CBC_CFG_CCIRMODE_CBY_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Cb0, Y0, Cr0, Y1 Position  */
#define ISC_CBC_CFG_CCIRMODE_CRY              (ISC_CBC_CFG_CCIRMODE_CRY_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Cr0, Y0, Cb0, Y1 Position  */
#define ISC_CBC_CFG_CCIRMODE_YCB              (ISC_CBC_CFG_CCIRMODE_YCB_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Y0, Cb0, Y1, Cr0 Position  */
#define ISC_CBC_CFG_CCIRMODE_YCR              (ISC_CBC_CFG_CCIRMODE_YCR_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Y0, Cr0, Y1, Cb0 Position  */
#define ISC_CBC_CFG_Msk                       _UINT32_(0x00000007)                                 /* (ISC_CBC_CFG) Register Mask  */


