Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
/** \brief ISC register offsets definitions */
#define ISC_DAD_REG_OFST               _UINT32_(0x00)      /* (ISC_DAD) DMA Address 0 Register Offset */
#define ISC_DST_REG_OFST               _UINT32_(0x04)      /* (ISC_DST) DMA Stride 0 Register Offset */
#define ISC_CTRLEN_REG_OFST            _UINT32_(0x00)      /* (ISC_CTRLEN) Control Enable Register Offset */
#define ISC_CTRLDIS_REG_OFST           _UINT32_(0x04)      /* (ISC_CTRLDIS) Control Disable Register Offset */
#define ISC_CTRLSR_REG_OFST            _UINT32_(0x08)      /* (ISC_CTRLSR) Control Status Register Offset */
#define ISC_PFE_CFG0_REG_OFST          _UINT32_(0x0C)      /* (ISC_PFE_CFG0) Parallel Front End Configuration 0 Register Offset */
#define ISC_PFE_CFG1_REG_OFST          _UINT32_(0x10)      /* (ISC_PFE_CFG1) Parallel Front End Configuration 1 Register Offset */
#define ISC_PFE_CFG2_REG_OFST          _UINT32_(0x14)      /* (ISC_PFE_CFG2) Parallel Front End Configuration 2 Register Offset */
#define ISC_CLKEN_REG_OFST             _UINT32_(0x18)      /* (ISC_CLKEN) Clock Enable Register Offset */
#define ISC_CLKDIS_REG_OFST            _UINT32_(0x1C)      /* (ISC_CLKDIS) Clock Disable Register Offset */
#define ISC_CLKSR_REG_OFST             _UINT32_(0x20)      /* (ISC_CLKSR) Clock Status Register Offset */
#define ISC_CLKCFG_REG_OFST            _UINT32_(0x24)      /* (ISC_CLKCFG) Clock Configuration Register Offset */
#define ISC_INTEN_REG_OFST             _UINT32_(0x28)      /* (ISC_INTEN) Interrupt Enable Register Offset */
#define ISC_INTDIS_REG_OFST            _UINT32_(0x2C)      /* (ISC_INTDIS) Interrupt Disable Register Offset */
#define ISC_INTMASK_REG_OFST           _UINT32_(0x30)      /* (ISC_INTMASK) Interrupt Mask Register Offset */
#define ISC_INTSR_REG_OFST             _UINT32_(0x34)      /* (ISC_INTSR) Interrupt Status Register Offset */
#define ISC_WB_CTRL_REG_OFST           _UINT32_(0x58)      /* (ISC_WB_CTRL) White Balance Control Register Offset */
#define ISC_WB_CFG_REG_OFST            _UINT32_(0x5C)      /* (ISC_WB_CFG) White Balance Configuration Register Offset */
#define ISC_WB_O_RGR_REG_OFST          _UINT32_(0x60)      /* (ISC_WB_O_RGR) White Balance Offset for R, GR Register Offset */
#define ISC_WB_O_BGB_REG_OFST          _UINT32_(0x64)      /* (ISC_WB_O_BGB) White Balance Offset for B, GB Register Offset */
#define ISC_WB_G_RGR_REG_OFST          _UINT32_(0x68)      /* (ISC_WB_G_RGR) White Balance Gain for R, GR Register Offset */
#define ISC_WB_G_BGB_REG_OFST          _UINT32_(0x6C)      /* (ISC_WB_G_BGB) White Balance Gain for B, GB Register Offset */
#define ISC_CFA_CTRL_REG_OFST          _UINT32_(0x70)      /* (ISC_CFA_CTRL) Color Filter Array Control Register Offset */
#define ISC_CFA_CFG_REG_OFST           _UINT32_(0x74)      /* (ISC_CFA_CFG) Color Filter Array Configuration Register Offset */
#define ISC_CC_CTRL_REG_OFST           _UINT32_(0x78)      /* (ISC_CC_CTRL) Color Correction Control Register Offset */
#define ISC_CC_RR_RG_REG_OFST          _UINT32_(0x7C)      /* (ISC_CC_RR_RG) Color Correction RR RG Register Offset */
#define ISC_CC_RB_OR_REG_OFST          _UINT32_(0x80)      /* (ISC_CC_RB_OR) Color Correction RB OR Register Offset */
#define ISC_CC_GR_GG_REG_OFST          _UINT32_(0x84)      /* (ISC_CC_GR_GG) Color Correction GR GG Register Offset */
#define ISC_CC_GB_OG_REG_OFST          _UINT32_(0x88)      /* (ISC_CC_GB_OG) Color Correction GB OG Register Offset */
#define ISC_CC_BR_BG_REG_OFST          _UINT32_(0x8C)      /* (ISC_CC_BR_BG) Color Correction BR BG Register Offset */
#define ISC_CC_BB_OB_REG_OFST          _UINT32_(0x90)      /* (ISC_CC_BB_OB) Color Correction BB OB Register Offset */
#define ISC_GAM_CTRL_REG_OFST          _UINT32_(0x94)      /* (ISC_GAM_CTRL) Gamma Correction Control Register Offset */
#define ISC_GAM_BENTRY_REG_OFST        _UINT32_(0x98)      /* (ISC_GAM_BENTRY) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY0_REG_OFST       _UINT32_(0x98)      /* (ISC_GAM_BENTRY0) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY1_REG_OFST       _UINT32_(0x9C)      /* (ISC_GAM_BENTRY1) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY2_REG_OFST       _UINT32_(0xA0)      /* (ISC_GAM_BENTRY2) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY3_REG_OFST       _UINT32_(0xA4)      /* (ISC_GAM_BENTRY3) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY4_REG_OFST       _UINT32_(0xA8)      /* (ISC_GAM_BENTRY4) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY5_REG_OFST       _UINT32_(0xAC)      /* (ISC_GAM_BENTRY5) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY6_REG_OFST       _UINT32_(0xB0)      /* (ISC_GAM_BENTRY6) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY7_REG_OFST       _UINT32_(0xB4)      /* (ISC_GAM_BENTRY7) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY8_REG_OFST       _UINT32_(0xB8)      /* (ISC_GAM_BENTRY8) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY9_REG_OFST       _UINT32_(0xBC)      /* (ISC_GAM_BENTRY9) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY10_REG_OFST      _UINT32_(0xC0)      /* (ISC_GAM_BENTRY10) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY11_REG_OFST      _UINT32_(0xC4)      /* (ISC_GAM_BENTRY11) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY12_REG_OFST      _UINT32_(0xC8)      /* (ISC_GAM_BENTRY12) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY13_REG_OFST      _UINT32_(0xCC)      /* (ISC_GAM_BENTRY13) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY14_REG_OFST      _UINT32_(0xD0)      /* (ISC_GAM_BENTRY14) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY15_REG_OFST      _UINT32_(0xD4)      /* (ISC_GAM_BENTRY15) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY16_REG_OFST      _UINT32_(0xD8)      /* (ISC_GAM_BENTRY16) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY17_REG_OFST      _UINT32_(0xDC)      /* (ISC_GAM_BENTRY17) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY18_REG_OFST      _UINT32_(0xE0)      /* (ISC_GAM_BENTRY18) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY19_REG_OFST      _UINT32_(0xE4)      /* (ISC_GAM_BENTRY19) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY20_REG_OFST      _UINT32_(0xE8)      /* (ISC_GAM_BENTRY20) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY21_REG_OFST      _UINT32_(0xEC)      /* (ISC_GAM_BENTRY21) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY22_REG_OFST      _UINT32_(0xF0)      /* (ISC_GAM_BENTRY22) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY23_REG_OFST      _UINT32_(0xF4)      /* (ISC_GAM_BENTRY23) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY24_REG_OFST      _UINT32_(0xF8)      /* (ISC_GAM_BENTRY24) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY25_REG_OFST      _UINT32_(0xFC)      /* (ISC_GAM_BENTRY25) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY26_REG_OFST      _UINT32_(0x100)     /* (ISC_GAM_BENTRY26) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY27_REG_OFST      _UINT32_(0x104)     /* (ISC_GAM_BENTRY27) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY28_REG_OFST      _UINT32_(0x108)     /* (ISC_GAM_BENTRY28) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY29_REG_OFST      _UINT32_(0x10C)     /* (ISC_GAM_BENTRY29) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY30_REG_OFST      _UINT32_(0x110)     /* (ISC_GAM_BENTRY30) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY31_REG_OFST      _UINT32_(0x114)     /* (ISC_GAM_BENTRY31) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY32_REG_OFST      _UINT32_(0x118)     /* (ISC_GAM_BENTRY32) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY33_REG_OFST      _UINT32_(0x11C)     /* (ISC_GAM_BENTRY33) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY34_REG_OFST      _UINT32_(0x120)     /* (ISC_GAM_BENTRY34) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY35_REG_OFST      _UINT32_(0x124)     /* (ISC_GAM_BENTRY35) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY36_REG_OFST      _UINT32_(0x128)     /* (ISC_GAM_BENTRY36) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY37_REG_OFST      _UINT32_(0x12C)     /* (ISC_GAM_BENTRY37) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY38_REG_OFST      _UINT32_(0x130)     /* (ISC_GAM_BENTRY38) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY39_REG_OFST      _UINT32_(0x134)     /* (ISC_GAM_BENTRY39) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY40_REG_OFST      _UINT32_(0x138)     /* (ISC_GAM_BENTRY40) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY41_REG_OFST      _UINT32_(0x13C)     /* (ISC_GAM_BENTRY41) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY42_REG_OFST      _UINT32_(0x140)     /* (ISC_GAM_BENTRY42) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY43_REG_OFST      _UINT32_(0x144)     /* (ISC_GAM_BENTRY43) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY44_REG_OFST      _UINT32_(0x148)     /* (ISC_GAM_BENTRY44) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY45_REG_OFST      _UINT32_(0x14C)     /* (ISC_GAM_BENTRY45) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY46_REG_OFST      _UINT32_(0x150)     /* (ISC_GAM_BENTRY46) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY47_REG_OFST      _UINT32_(0x154)     /* (ISC_GAM_BENTRY47) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY48_REG_OFST      _UINT32_(0x158)     /* (ISC_GAM_BENTRY48) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY49_REG_OFST      _UINT32_(0x15C)     /* (ISC_GAM_BENTRY49) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY50_REG_OFST      _UINT32_(0x160)     /* (ISC_GAM_BENTRY50) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY51_REG_OFST      _UINT32_(0x164)     /* (ISC_GAM_BENTRY51) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY52_REG_OFST      _UINT32_(0x168)     /* (ISC_GAM_BENTRY52) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY53_REG_OFST      _UINT32_(0x16C)     /* (ISC_GAM_BENTRY53) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY54_REG_OFST      _UINT32_(0x170)     /* (ISC_GAM_BENTRY54) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY55_REG_OFST      _UINT32_(0x174)     /* (ISC_GAM_BENTRY55) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY56_REG_OFST      _UINT32_(0x178)     /* (ISC_GAM_BENTRY56) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY57_REG_OFST      _UINT32_(0x17C)     /* (ISC_GAM_BENTRY57) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY58_REG_OFST      _UINT32_(0x180)     /* (ISC_GAM_BENTRY58) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY59_REG_OFST      _UINT32_(0x184)     /* (ISC_GAM_BENTRY59) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY60_REG_OFST      _UINT32_(0x188)     /* (ISC_GAM_BENTRY60) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY61_REG_OFST      _UINT32_(0x18C)     /* (ISC_GAM_BENTRY61) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY62_REG_OFST      _UINT32_(0x190)     /* (ISC_GAM_BENTRY62) Gamma Correction Blue Entry Offset */
#define ISC_GAM_BENTRY63_REG_OFST      _UINT32_(0x194)     /* (ISC_GAM_BENTRY63) Gamma Correction Blue Entry Offset */
#define ISC_GAM_GENTRY_REG_OFST        _UINT32_(0x198)     /* (ISC_GAM_GENTRY) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY0_REG_OFST       _UINT32_(0x198)     /* (ISC_GAM_GENTRY0) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY1_REG_OFST       _UINT32_(0x19C)     /* (ISC_GAM_GENTRY1) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY2_REG_OFST       _UINT32_(0x1A0)     /* (ISC_GAM_GENTRY2) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY3_REG_OFST       _UINT32_(0x1A4)     /* (ISC_GAM_GENTRY3) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY4_REG_OFST       _UINT32_(0x1A8)     /* (ISC_GAM_GENTRY4) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY5_REG_OFST       _UINT32_(0x1AC)     /* (ISC_GAM_GENTRY5) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY6_REG_OFST       _UINT32_(0x1B0)     /* (ISC_GAM_GENTRY6) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY7_REG_OFST       _UINT32_(0x1B4)     /* (ISC_GAM_GENTRY7) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY8_REG_OFST       _UINT32_(0x1B8)     /* (ISC_GAM_GENTRY8) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY9_REG_OFST       _UINT32_(0x1BC)     /* (ISC_GAM_GENTRY9) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY10_REG_OFST      _UINT32_(0x1C0)     /* (ISC_GAM_GENTRY10) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY11_REG_OFST      _UINT32_(0x1C4)     /* (ISC_GAM_GENTRY11) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY12_REG_OFST      _UINT32_(0x1C8)     /* (ISC_GAM_GENTRY12) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY13_REG_OFST      _UINT32_(0x1CC)     /* (ISC_GAM_GENTRY13) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY14_REG_OFST      _UINT32_(0x1D0)     /* (ISC_GAM_GENTRY14) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY15_REG_OFST      _UINT32_(0x1D4)     /* (ISC_GAM_GENTRY15) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY16_REG_OFST      _UINT32_(0x1D8)     /* (ISC_GAM_GENTRY16) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY17_REG_OFST      _UINT32_(0x1DC)     /* (ISC_GAM_GENTRY17) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY18_REG_OFST      _UINT32_(0x1E0)     /* (ISC_GAM_GENTRY18) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY19_REG_OFST      _UINT32_(0x1E4)     /* (ISC_GAM_GENTRY19) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY20_REG_OFST      _UINT32_(0x1E8)     /* (ISC_GAM_GENTRY20) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY21_REG_OFST      _UINT32_(0x1EC)     /* (ISC_GAM_GENTRY21) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY22_REG_OFST      _UINT32_(0x1F0)     /* (ISC_GAM_GENTRY22) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY23_REG_OFST      _UINT32_(0x1F4)     /* (ISC_GAM_GENTRY23) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY24_REG_OFST      _UINT32_(0x1F8)     /* (ISC_GAM_GENTRY24) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY25_REG_OFST      _UINT32_(0x1FC)     /* (ISC_GAM_GENTRY25) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY26_REG_OFST      _UINT32_(0x200)     /* (ISC_GAM_GENTRY26) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY27_REG_OFST      _UINT32_(0x204)     /* (ISC_GAM_GENTRY27) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY28_REG_OFST      _UINT32_(0x208)     /* (ISC_GAM_GENTRY28) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY29_REG_OFST      _UINT32_(0x20C)     /* (ISC_GAM_GENTRY29) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY30_REG_OFST      _UINT32_(0x210)     /* (ISC_GAM_GENTRY30) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY31_REG_OFST      _UINT32_(0x214)     /* (ISC_GAM_GENTRY31) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY32_REG_OFST      _UINT32_(0x218)     /* (ISC_GAM_GENTRY32) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY33_REG_OFST      _UINT32_(0x21C)     /* (ISC_GAM_GENTRY33) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY34_REG_OFST      _UINT32_(0x220)     /* (ISC_GAM_GENTRY34) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY35_REG_OFST      _UINT32_(0x224)     /* (ISC_GAM_GENTRY35) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY36_REG_OFST      _UINT32_(0x228)     /* (ISC_GAM_GENTRY36) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY37_REG_OFST      _UINT32_(0x22C)     /* (ISC_GAM_GENTRY37) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY38_REG_OFST      _UINT32_(0x230)     /* (ISC_GAM_GENTRY38) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY39_REG_OFST      _UINT32_(0x234)     /* (ISC_GAM_GENTRY39) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY40_REG_OFST      _UINT32_(0x238)     /* (ISC_GAM_GENTRY40) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY41_REG_OFST      _UINT32_(0x23C)     /* (ISC_GAM_GENTRY41) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY42_REG_OFST      _UINT32_(0x240)     /* (ISC_GAM_GENTRY42) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY43_REG_OFST      _UINT32_(0x244)     /* (ISC_GAM_GENTRY43) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY44_REG_OFST      _UINT32_(0x248)     /* (ISC_GAM_GENTRY44) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY45_REG_OFST      _UINT32_(0x24C)     /* (ISC_GAM_GENTRY45) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY46_REG_OFST      _UINT32_(0x250)     /* (ISC_GAM_GENTRY46) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY47_REG_OFST      _UINT32_(0x254)     /* (ISC_GAM_GENTRY47) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY48_REG_OFST      _UINT32_(0x258)     /* (ISC_GAM_GENTRY48) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY49_REG_OFST      _UINT32_(0x25C)     /* (ISC_GAM_GENTRY49) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY50_REG_OFST      _UINT32_(0x260)     /* (ISC_GAM_GENTRY50) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY51_REG_OFST      _UINT32_(0x264)     /* (ISC_GAM_GENTRY51) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY52_REG_OFST      _UINT32_(0x268)     /* (ISC_GAM_GENTRY52) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY53_REG_OFST      _UINT32_(0x26C)     /* (ISC_GAM_GENTRY53) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY54_REG_OFST      _UINT32_(0x270)     /* (ISC_GAM_GENTRY54) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY55_REG_OFST      _UINT32_(0x274)     /* (ISC_GAM_GENTRY55) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY56_REG_OFST      _UINT32_(0x278)     /* (ISC_GAM_GENTRY56) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY57_REG_OFST      _UINT32_(0x27C)     /* (ISC_GAM_GENTRY57) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY58_REG_OFST      _UINT32_(0x280)     /* (ISC_GAM_GENTRY58) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY59_REG_OFST      _UINT32_(0x284)     /* (ISC_GAM_GENTRY59) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY60_REG_OFST      _UINT32_(0x288)     /* (ISC_GAM_GENTRY60) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY61_REG_OFST      _UINT32_(0x28C)     /* (ISC_GAM_GENTRY61) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY62_REG_OFST      _UINT32_(0x290)     /* (ISC_GAM_GENTRY62) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY63_REG_OFST      _UINT32_(0x294)     /* (ISC_GAM_GENTRY63) Gamma Correction Green Entry Offset */
#define ISC_GAM_RENTRY_REG_OFST        _UINT32_(0x298)     /* (ISC_GAM_RENTRY) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY0_REG_OFST       _UINT32_(0x298)     /* (ISC_GAM_RENTRY0) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY1_REG_OFST       _UINT32_(0x29C)     /* (ISC_GAM_RENTRY1) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY2_REG_OFST       _UINT32_(0x2A0)     /* (ISC_GAM_RENTRY2) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY3_REG_OFST       _UINT32_(0x2A4)     /* (ISC_GAM_RENTRY3) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY4_REG_OFST       _UINT32_(0x2A8)     /* (ISC_GAM_RENTRY4) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY5_REG_OFST       _UINT32_(0x2AC)     /* (ISC_GAM_RENTRY5) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY6_REG_OFST       _UINT32_(0x2B0)     /* (ISC_GAM_RENTRY6) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY7_REG_OFST       _UINT32_(0x2B4)     /* (ISC_GAM_RENTRY7) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY8_REG_OFST       _UINT32_(0x2B8)     /* (ISC_GAM_RENTRY8) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY9_REG_OFST       _UINT32_(0x2BC)     /* (ISC_GAM_RENTRY9) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY10_REG_OFST      _UINT32_(0x2C0)     /* (ISC_GAM_RENTRY10) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY11_REG_OFST      _UINT32_(0x2C4)     /* (ISC_GAM_RENTRY11) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY12_REG_OFST      _UINT32_(0x2C8)     /* (ISC_GAM_RENTRY12) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY13_REG_OFST      _UINT32_(0x2CC)     /* (ISC_GAM_RENTRY13) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY14_REG_OFST      _UINT32_(0x2D0)     /* (ISC_GAM_RENTRY14) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY15_REG_OFST      _UINT32_(0x2D4)     /* (ISC_GAM_RENTRY15) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY16_REG_OFST      _UINT32_(0x2D8)     /* (ISC_GAM_RENTRY16) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY17_REG_OFST      _UINT32_(0x2DC)     /* (ISC_GAM_RENTRY17) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY18_REG_OFST      _UINT32_(0x2E0)     /* (ISC_GAM_RENTRY18) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY19_REG_OFST      _UINT32_(0x2E4)     /* (ISC_GAM_RENTRY19) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY20_REG_OFST      _UINT32_(0x2E8)     /* (ISC_GAM_RENTRY20) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY21_REG_OFST      _UINT32_(0x2EC)     /* (ISC_GAM_RENTRY21) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY22_REG_OFST      _UINT32_(0x2F0)     /* (ISC_GAM_RENTRY22) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY23_REG_OFST      _UINT32_(0x2F4)     /* (ISC_GAM_RENTRY23) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY24_REG_OFST      _UINT32_(0x2F8)     /* (ISC_GAM_RENTRY24) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY25_REG_OFST      _UINT32_(0x2FC)     /* (ISC_GAM_RENTRY25) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY26_REG_OFST      _UINT32_(0x300)     /* (ISC_GAM_RENTRY26) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY27_REG_OFST      _UINT32_(0x304)     /* (ISC_GAM_RENTRY27) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY28_REG_OFST      _UINT32_(0x308)     /* (ISC_GAM_RENTRY28) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY29_REG_OFST      _UINT32_(0x30C)     /* (ISC_GAM_RENTRY29) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY30_REG_OFST      _UINT32_(0x310)     /* (ISC_GAM_RENTRY30) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY31_REG_OFST      _UINT32_(0x314)     /* (ISC_GAM_RENTRY31) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY32_REG_OFST      _UINT32_(0x318)     /* (ISC_GAM_RENTRY32) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY33_REG_OFST      _UINT32_(0x31C)     /* (ISC_GAM_RENTRY33) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY34_REG_OFST      _UINT32_(0x320)     /* (ISC_GAM_RENTRY34) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY35_REG_OFST      _UINT32_(0x324)     /* (ISC_GAM_RENTRY35) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY36_REG_OFST      _UINT32_(0x328)     /* (ISC_GAM_RENTRY36) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY37_REG_OFST      _UINT32_(0x32C)     /* (ISC_GAM_RENTRY37) Gamma Correction Red Entry Offset */
