Microchip-MPLAB-Harmony/usb_apps_device/apps/hid_basic/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/isc.h
#define ISC_GAM_RENTRY38_REG_OFST      _UINT32_(0x330)     /* (ISC_GAM_RENTRY38) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY39_REG_OFST      _UINT32_(0x334)     /* (ISC_GAM_RENTRY39) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY40_REG_OFST      _UINT32_(0x338)     /* (ISC_GAM_RENTRY40) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY41_REG_OFST      _UINT32_(0x33C)     /* (ISC_GAM_RENTRY41) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY42_REG_OFST      _UINT32_(0x340)     /* (ISC_GAM_RENTRY42) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY43_REG_OFST      _UINT32_(0x344)     /* (ISC_GAM_RENTRY43) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY44_REG_OFST      _UINT32_(0x348)     /* (ISC_GAM_RENTRY44) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY45_REG_OFST      _UINT32_(0x34C)     /* (ISC_GAM_RENTRY45) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY46_REG_OFST      _UINT32_(0x350)     /* (ISC_GAM_RENTRY46) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY47_REG_OFST      _UINT32_(0x354)     /* (ISC_GAM_RENTRY47) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY48_REG_OFST      _UINT32_(0x358)     /* (ISC_GAM_RENTRY48) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY49_REG_OFST      _UINT32_(0x35C)     /* (ISC_GAM_RENTRY49) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY50_REG_OFST      _UINT32_(0x360)     /* (ISC_GAM_RENTRY50) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY51_REG_OFST      _UINT32_(0x364)     /* (ISC_GAM_RENTRY51) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY52_REG_OFST      _UINT32_(0x368)     /* (ISC_GAM_RENTRY52) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY53_REG_OFST      _UINT32_(0x36C)     /* (ISC_GAM_RENTRY53) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY54_REG_OFST      _UINT32_(0x370)     /* (ISC_GAM_RENTRY54) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY55_REG_OFST      _UINT32_(0x374)     /* (ISC_GAM_RENTRY55) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY56_REG_OFST      _UINT32_(0x378)     /* (ISC_GAM_RENTRY56) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY57_REG_OFST      _UINT32_(0x37C)     /* (ISC_GAM_RENTRY57) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY58_REG_OFST      _UINT32_(0x380)     /* (ISC_GAM_RENTRY58) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY59_REG_OFST      _UINT32_(0x384)     /* (ISC_GAM_RENTRY59) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY60_REG_OFST      _UINT32_(0x388)     /* (ISC_GAM_RENTRY60) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY61_REG_OFST      _UINT32_(0x38C)     /* (ISC_GAM_RENTRY61) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY62_REG_OFST      _UINT32_(0x390)     /* (ISC_GAM_RENTRY62) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY63_REG_OFST      _UINT32_(0x394)     /* (ISC_GAM_RENTRY63) Gamma Correction Red Entry Offset */
#define ISC_CSC_CTRL_REG_OFST          _UINT32_(0x398)     /* (ISC_CSC_CTRL) Color Space Conversion Control Register Offset */
#define ISC_CSC_YR_YG_REG_OFST         _UINT32_(0x39C)     /* (ISC_CSC_YR_YG) Color Space Conversion YR, YG Register Offset */
#define ISC_CSC_YB_OY_REG_OFST         _UINT32_(0x3A0)     /* (ISC_CSC_YB_OY) Color Space Conversion YB, OY Register Offset */
#define ISC_CSC_CBR_CBG_REG_OFST       _UINT32_(0x3A4)     /* (ISC_CSC_CBR_CBG) Color Space Conversion CBR CBG Register Offset */
#define ISC_CSC_CBB_OCB_REG_OFST       _UINT32_(0x3A8)     /* (ISC_CSC_CBB_OCB) Color Space Conversion CBB OCB Register Offset */
#define ISC_CSC_CRR_CRG_REG_OFST       _UINT32_(0x3AC)     /* (ISC_CSC_CRR_CRG) Color Space Conversion CRR CRG Register Offset */
#define ISC_CSC_CRB_OCR_REG_OFST       _UINT32_(0x3B0)     /* (ISC_CSC_CRB_OCR) Color Space Conversion CRB OCR Register Offset */
#define ISC_CBC_CTRL_REG_OFST          _UINT32_(0x3B4)     /* (ISC_CBC_CTRL) Contrast and Brightness Control Register Offset */
#define ISC_CBC_CFG_REG_OFST           _UINT32_(0x3B8)     /* (ISC_CBC_CFG) Contrast and Brightness Configuration Register Offset */
#define ISC_CBC_BRIGHT_REG_OFST        _UINT32_(0x3BC)     /* (ISC_CBC_BRIGHT) Contrast and Brightness, Brightness Register Offset */
#define ISC_CBC_CONTRAST_REG_OFST      _UINT32_(0x3C0)     /* (ISC_CBC_CONTRAST) Contrast and Brightness, Contrast Register Offset */
#define ISC_SUB422_CTRL_REG_OFST       _UINT32_(0x3C4)     /* (ISC_SUB422_CTRL) Subsampling 4:4:4 to 4:2:2 Control Register Offset */
#define ISC_SUB422_CFG_REG_OFST        _UINT32_(0x3C8)     /* (ISC_SUB422_CFG) Subsampling 4:4:4 to 4:2:2 Configuration Register Offset */
#define ISC_SUB420_CTRL_REG_OFST       _UINT32_(0x3CC)     /* (ISC_SUB420_CTRL) Subsampling 4:2:2 to 4:2:0 Control Register Offset */
#define ISC_RLP_CFG_REG_OFST           _UINT32_(0x3D0)     /* (ISC_RLP_CFG) Rounding, Limiting and Packing Configuration Register Offset */
#define ISC_HIS_CTRL_REG_OFST          _UINT32_(0x3D4)     /* (ISC_HIS_CTRL) Histogram Control Register Offset */
#define ISC_HIS_CFG_REG_OFST           _UINT32_(0x3D8)     /* (ISC_HIS_CFG) Histogram Configuration Register Offset */
#define ISC_DCFG_REG_OFST              _UINT32_(0x3E0)     /* (ISC_DCFG) DMA Configuration Register Offset */
#define ISC_DCTRL_REG_OFST             _UINT32_(0x3E4)     /* (ISC_DCTRL) DMA Control Register Offset */
#define ISC_DNDA_REG_OFST              _UINT32_(0x3E8)     /* (ISC_DNDA) DMA Descriptor Address Register Offset */
#define ISC_HIS_ENTRY_REG_OFST         _UINT32_(0x410)     /* (ISC_HIS_ENTRY) Histogram Entry Offset */
#define ISC_HIS_ENTRY0_REG_OFST        _UINT32_(0x410)     /* (ISC_HIS_ENTRY0) Histogram Entry Offset */
#define ISC_HIS_ENTRY1_REG_OFST        _UINT32_(0x414)     /* (ISC_HIS_ENTRY1) Histogram Entry Offset */
#define ISC_HIS_ENTRY2_REG_OFST        _UINT32_(0x418)     /* (ISC_HIS_ENTRY2) Histogram Entry Offset */
#define ISC_HIS_ENTRY3_REG_OFST        _UINT32_(0x41C)     /* (ISC_HIS_ENTRY3) Histogram Entry Offset */
#define ISC_HIS_ENTRY4_REG_OFST        _UINT32_(0x420)     /* (ISC_HIS_ENTRY4) Histogram Entry Offset */
#define ISC_HIS_ENTRY5_REG_OFST        _UINT32_(0x424)     /* (ISC_HIS_ENTRY5) Histogram Entry Offset */
#define ISC_HIS_ENTRY6_REG_OFST        _UINT32_(0x428)     /* (ISC_HIS_ENTRY6) Histogram Entry Offset */
#define ISC_HIS_ENTRY7_REG_OFST        _UINT32_(0x42C)     /* (ISC_HIS_ENTRY7) Histogram Entry Offset */
#define ISC_HIS_ENTRY8_REG_OFST        _UINT32_(0x430)     /* (ISC_HIS_ENTRY8) Histogram Entry Offset */
#define ISC_HIS_ENTRY9_REG_OFST        _UINT32_(0x434)     /* (ISC_HIS_ENTRY9) Histogram Entry Offset */
#define ISC_HIS_ENTRY10_REG_OFST       _UINT32_(0x438)     /* (ISC_HIS_ENTRY10) Histogram Entry Offset */
#define ISC_HIS_ENTRY11_REG_OFST       _UINT32_(0x43C)     /* (ISC_HIS_ENTRY11) Histogram Entry Offset */
#define ISC_HIS_ENTRY12_REG_OFST       _UINT32_(0x440)     /* (ISC_HIS_ENTRY12) Histogram Entry Offset */
#define ISC_HIS_ENTRY13_REG_OFST       _UINT32_(0x444)     /* (ISC_HIS_ENTRY13) Histogram Entry Offset */
#define ISC_HIS_ENTRY14_REG_OFST       _UINT32_(0x448)     /* (ISC_HIS_ENTRY14) Histogram Entry Offset */
#define ISC_HIS_ENTRY15_REG_OFST       _UINT32_(0x44C)     /* (ISC_HIS_ENTRY15) Histogram Entry Offset */
#define ISC_HIS_ENTRY16_REG_OFST       _UINT32_(0x450)     /* (ISC_HIS_ENTRY16) Histogram Entry Offset */
#define ISC_HIS_ENTRY17_REG_OFST       _UINT32_(0x454)     /* (ISC_HIS_ENTRY17) Histogram Entry Offset */
#define ISC_HIS_ENTRY18_REG_OFST       _UINT32_(0x458)     /* (ISC_HIS_ENTRY18) Histogram Entry Offset */
#define ISC_HIS_ENTRY19_REG_OFST       _UINT32_(0x45C)     /* (ISC_HIS_ENTRY19) Histogram Entry Offset */
#define ISC_HIS_ENTRY20_REG_OFST       _UINT32_(0x460)     /* (ISC_HIS_ENTRY20) Histogram Entry Offset */
#define ISC_HIS_ENTRY21_REG_OFST       _UINT32_(0x464)     /* (ISC_HIS_ENTRY21) Histogram Entry Offset */
#define ISC_HIS_ENTRY22_REG_OFST       _UINT32_(0x468)     /* (ISC_HIS_ENTRY22) Histogram Entry Offset */
#define ISC_HIS_ENTRY23_REG_OFST       _UINT32_(0x46C)     /* (ISC_HIS_ENTRY23) Histogram Entry Offset */
#define ISC_HIS_ENTRY24_REG_OFST       _UINT32_(0x470)     /* (ISC_HIS_ENTRY24) Histogram Entry Offset */
#define ISC_HIS_ENTRY25_REG_OFST       _UINT32_(0x474)     /* (ISC_HIS_ENTRY25) Histogram Entry Offset */
#define ISC_HIS_ENTRY26_REG_OFST       _UINT32_(0x478)     /* (ISC_HIS_ENTRY26) Histogram Entry Offset */
#define ISC_HIS_ENTRY27_REG_OFST       _UINT32_(0x47C)     /* (ISC_HIS_ENTRY27) Histogram Entry Offset */
#define ISC_HIS_ENTRY28_REG_OFST       _UINT32_(0x480)     /* (ISC_HIS_ENTRY28) Histogram Entry Offset */
#define ISC_HIS_ENTRY29_REG_OFST       _UINT32_(0x484)     /* (ISC_HIS_ENTRY29) Histogram Entry Offset */
#define ISC_HIS_ENTRY30_REG_OFST       _UINT32_(0x488)     /* (ISC_HIS_ENTRY30) Histogram Entry Offset */
#define ISC_HIS_ENTRY31_REG_OFST       _UINT32_(0x48C)     /* (ISC_HIS_ENTRY31) Histogram Entry Offset */
#define ISC_HIS_ENTRY32_REG_OFST       _UINT32_(0x490)     /* (ISC_HIS_ENTRY32) Histogram Entry Offset */
#define ISC_HIS_ENTRY33_REG_OFST       _UINT32_(0x494)     /* (ISC_HIS_ENTRY33) Histogram Entry Offset */
#define ISC_HIS_ENTRY34_REG_OFST       _UINT32_(0x498)     /* (ISC_HIS_ENTRY34) Histogram Entry Offset */
#define ISC_HIS_ENTRY35_REG_OFST       _UINT32_(0x49C)     /* (ISC_HIS_ENTRY35) Histogram Entry Offset */
#define ISC_HIS_ENTRY36_REG_OFST       _UINT32_(0x4A0)     /* (ISC_HIS_ENTRY36) Histogram Entry Offset */
#define ISC_HIS_ENTRY37_REG_OFST       _UINT32_(0x4A4)     /* (ISC_HIS_ENTRY37) Histogram Entry Offset */
#define ISC_HIS_ENTRY38_REG_OFST       _UINT32_(0x4A8)     /* (ISC_HIS_ENTRY38) Histogram Entry Offset */
#define ISC_HIS_ENTRY39_REG_OFST       _UINT32_(0x4AC)     /* (ISC_HIS_ENTRY39) Histogram Entry Offset */
#define ISC_HIS_ENTRY40_REG_OFST       _UINT32_(0x4B0)     /* (ISC_HIS_ENTRY40) Histogram Entry Offset */
#define ISC_HIS_ENTRY41_REG_OFST       _UINT32_(0x4B4)     /* (ISC_HIS_ENTRY41) Histogram Entry Offset */
#define ISC_HIS_ENTRY42_REG_OFST       _UINT32_(0x4B8)     /* (ISC_HIS_ENTRY42) Histogram Entry Offset */
#define ISC_HIS_ENTRY43_REG_OFST       _UINT32_(0x4BC)     /* (ISC_HIS_ENTRY43) Histogram Entry Offset */
#define ISC_HIS_ENTRY44_REG_OFST       _UINT32_(0x4C0)     /* (ISC_HIS_ENTRY44) Histogram Entry Offset */
#define ISC_HIS_ENTRY45_REG_OFST       _UINT32_(0x4C4)     /* (ISC_HIS_ENTRY45) Histogram Entry Offset */
#define ISC_HIS_ENTRY46_REG_OFST       _UINT32_(0x4C8)     /* (ISC_HIS_ENTRY46) Histogram Entry Offset */
#define ISC_HIS_ENTRY47_REG_OFST       _UINT32_(0x4CC)     /* (ISC_HIS_ENTRY47) Histogram Entry Offset */
#define ISC_HIS_ENTRY48_REG_OFST       _UINT32_(0x4D0)     /* (ISC_HIS_ENTRY48) Histogram Entry Offset */
#define ISC_HIS_ENTRY49_REG_OFST       _UINT32_(0x4D4)     /* (ISC_HIS_ENTRY49) Histogram Entry Offset */
#define ISC_HIS_ENTRY50_REG_OFST       _UINT32_(0x4D8)     /* (ISC_HIS_ENTRY50) Histogram Entry Offset */
#define ISC_HIS_ENTRY51_REG_OFST       _UINT32_(0x4DC)     /* (ISC_HIS_ENTRY51) Histogram Entry Offset */
#define ISC_HIS_ENTRY52_REG_OFST       _UINT32_(0x4E0)     /* (ISC_HIS_ENTRY52) Histogram Entry Offset */
#define ISC_HIS_ENTRY53_REG_OFST       _UINT32_(0x4E4)     /* (ISC_HIS_ENTRY53) Histogram Entry Offset */
#define ISC_HIS_ENTRY54_REG_OFST       _UINT32_(0x4E8)     /* (ISC_HIS_ENTRY54) Histogram Entry Offset */
#define ISC_HIS_ENTRY55_REG_OFST       _UINT32_(0x4EC)     /* (ISC_HIS_ENTRY55) Histogram Entry Offset */
#define ISC_HIS_ENTRY56_REG_OFST       _UINT32_(0x4F0)     /* (ISC_HIS_ENTRY56) Histogram Entry Offset */
#define ISC_HIS_ENTRY57_REG_OFST       _UINT32_(0x4F4)     /* (ISC_HIS_ENTRY57) Histogram Entry Offset */
#define ISC_HIS_ENTRY58_REG_OFST       _UINT32_(0x4F8)     /* (ISC_HIS_ENTRY58) Histogram Entry Offset */
#define ISC_HIS_ENTRY59_REG_OFST       _UINT32_(0x4FC)     /* (ISC_HIS_ENTRY59) Histogram Entry Offset */
#define ISC_HIS_ENTRY60_REG_OFST       _UINT32_(0x500)     /* (ISC_HIS_ENTRY60) Histogram Entry Offset */
#define ISC_HIS_ENTRY61_REG_OFST       _UINT32_(0x504)     /* (ISC_HIS_ENTRY61) Histogram Entry Offset */
#define ISC_HIS_ENTRY62_REG_OFST       _UINT32_(0x508)     /* (ISC_HIS_ENTRY62) Histogram Entry Offset */
#define ISC_HIS_ENTRY63_REG_OFST       _UINT32_(0x50C)     /* (ISC_HIS_ENTRY63) Histogram Entry Offset */
#define ISC_HIS_ENTRY64_REG_OFST       _UINT32_(0x510)     /* (ISC_HIS_ENTRY64) Histogram Entry Offset */
#define ISC_HIS_ENTRY65_REG_OFST       _UINT32_(0x514)     /* (ISC_HIS_ENTRY65) Histogram Entry Offset */
#define ISC_HIS_ENTRY66_REG_OFST       _UINT32_(0x518)     /* (ISC_HIS_ENTRY66) Histogram Entry Offset */
#define ISC_HIS_ENTRY67_REG_OFST       _UINT32_(0x51C)     /* (ISC_HIS_ENTRY67) Histogram Entry Offset */
#define ISC_HIS_ENTRY68_REG_OFST       _UINT32_(0x520)     /* (ISC_HIS_ENTRY68) Histogram Entry Offset */
#define ISC_HIS_ENTRY69_REG_OFST       _UINT32_(0x524)     /* (ISC_HIS_ENTRY69) Histogram Entry Offset */
#define ISC_HIS_ENTRY70_REG_OFST       _UINT32_(0x528)     /* (ISC_HIS_ENTRY70) Histogram Entry Offset */
#define ISC_HIS_ENTRY71_REG_OFST       _UINT32_(0x52C)     /* (ISC_HIS_ENTRY71) Histogram Entry Offset */
#define ISC_HIS_ENTRY72_REG_OFST       _UINT32_(0x530)     /* (ISC_HIS_ENTRY72) Histogram Entry Offset */
#define ISC_HIS_ENTRY73_REG_OFST       _UINT32_(0x534)     /* (ISC_HIS_ENTRY73) Histogram Entry Offset */
#define ISC_HIS_ENTRY74_REG_OFST       _UINT32_(0x538)     /* (ISC_HIS_ENTRY74) Histogram Entry Offset */
#define ISC_HIS_ENTRY75_REG_OFST       _UINT32_(0x53C)     /* (ISC_HIS_ENTRY75) Histogram Entry Offset */
#define ISC_HIS_ENTRY76_REG_OFST       _UINT32_(0x540)     /* (ISC_HIS_ENTRY76) Histogram Entry Offset */
#define ISC_HIS_ENTRY77_REG_OFST       _UINT32_(0x544)     /* (ISC_HIS_ENTRY77) Histogram Entry Offset */
#define ISC_HIS_ENTRY78_REG_OFST       _UINT32_(0x548)     /* (ISC_HIS_ENTRY78) Histogram Entry Offset */
#define ISC_HIS_ENTRY79_REG_OFST       _UINT32_(0x54C)     /* (ISC_HIS_ENTRY79) Histogram Entry Offset */
#define ISC_HIS_ENTRY80_REG_OFST       _UINT32_(0x550)     /* (ISC_HIS_ENTRY80) Histogram Entry Offset */
#define ISC_HIS_ENTRY81_REG_OFST       _UINT32_(0x554)     /* (ISC_HIS_ENTRY81) Histogram Entry Offset */
#define ISC_HIS_ENTRY82_REG_OFST       _UINT32_(0x558)     /* (ISC_HIS_ENTRY82) Histogram Entry Offset */
#define ISC_HIS_ENTRY83_REG_OFST       _UINT32_(0x55C)     /* (ISC_HIS_ENTRY83) Histogram Entry Offset */
#define ISC_HIS_ENTRY84_REG_OFST       _UINT32_(0x560)     /* (ISC_HIS_ENTRY84) Histogram Entry Offset */
#define ISC_HIS_ENTRY85_REG_OFST       _UINT32_(0x564)     /* (ISC_HIS_ENTRY85) Histogram Entry Offset */
#define ISC_HIS_ENTRY86_REG_OFST       _UINT32_(0x568)     /* (ISC_HIS_ENTRY86) Histogram Entry Offset */
#define ISC_HIS_ENTRY87_REG_OFST       _UINT32_(0x56C)     /* (ISC_HIS_ENTRY87) Histogram Entry Offset */
#define ISC_HIS_ENTRY88_REG_OFST       _UINT32_(0x570)     /* (ISC_HIS_ENTRY88) Histogram Entry Offset */
#define ISC_HIS_ENTRY89_REG_OFST       _UINT32_(0x574)     /* (ISC_HIS_ENTRY89) Histogram Entry Offset */
#define ISC_HIS_ENTRY90_REG_OFST       _UINT32_(0x578)     /* (ISC_HIS_ENTRY90) Histogram Entry Offset */
#define ISC_HIS_ENTRY91_REG_OFST       _UINT32_(0x57C)     /* (ISC_HIS_ENTRY91) Histogram Entry Offset */
#define ISC_HIS_ENTRY92_REG_OFST       _UINT32_(0x580)     /* (ISC_HIS_ENTRY92) Histogram Entry Offset */
#define ISC_HIS_ENTRY93_REG_OFST       _UINT32_(0x584)     /* (ISC_HIS_ENTRY93) Histogram Entry Offset */
#define ISC_HIS_ENTRY94_REG_OFST       _UINT32_(0x588)     /* (ISC_HIS_ENTRY94) Histogram Entry Offset */
#define ISC_HIS_ENTRY95_REG_OFST       _UINT32_(0x58C)     /* (ISC_HIS_ENTRY95) Histogram Entry Offset */
#define ISC_HIS_ENTRY96_REG_OFST       _UINT32_(0x590)     /* (ISC_HIS_ENTRY96) Histogram Entry Offset */
#define ISC_HIS_ENTRY97_REG_OFST       _UINT32_(0x594)     /* (ISC_HIS_ENTRY97) Histogram Entry Offset */
#define ISC_HIS_ENTRY98_REG_OFST       _UINT32_(0x598)     /* (ISC_HIS_ENTRY98) Histogram Entry Offset */
#define ISC_HIS_ENTRY99_REG_OFST       _UINT32_(0x59C)     /* (ISC_HIS_ENTRY99) Histogram Entry Offset */
#define ISC_HIS_ENTRY100_REG_OFST      _UINT32_(0x5A0)     /* (ISC_HIS_ENTRY100) Histogram Entry Offset */
#define ISC_HIS_ENTRY101_REG_OFST      _UINT32_(0x5A4)     /* (ISC_HIS_ENTRY101) Histogram Entry Offset */
#define ISC_HIS_ENTRY102_REG_OFST      _UINT32_(0x5A8)     /* (ISC_HIS_ENTRY102) Histogram Entry Offset */
#define ISC_HIS_ENTRY103_REG_OFST      _UINT32_(0x5AC)     /* (ISC_HIS_ENTRY103) Histogram Entry Offset */
#define ISC_HIS_ENTRY104_REG_OFST      _UINT32_(0x5B0)     /* (ISC_HIS_ENTRY104) Histogram Entry Offset */
#define ISC_HIS_ENTRY105_REG_OFST      _UINT32_(0x5B4)     /* (ISC_HIS_ENTRY105) Histogram Entry Offset */
#define ISC_HIS_ENTRY106_REG_OFST      _UINT32_(0x5B8)     /* (ISC_HIS_ENTRY106) Histogram Entry Offset */
#define ISC_HIS_ENTRY107_REG_OFST      _UINT32_(0x5BC)     /* (ISC_HIS_ENTRY107) Histogram Entry Offset */
#define ISC_HIS_ENTRY108_REG_OFST      _UINT32_(0x5C0)     /* (ISC_HIS_ENTRY108) Histogram Entry Offset */
#define ISC_HIS_ENTRY109_REG_OFST      _UINT32_(0x5C4)     /* (ISC_HIS_ENTRY109) Histogram Entry Offset */
#define ISC_HIS_ENTRY110_REG_OFST      _UINT32_(0x5C8)     /* (ISC_HIS_ENTRY110) Histogram Entry Offset */
#define ISC_HIS_ENTRY111_REG_OFST      _UINT32_(0x5CC)     /* (ISC_HIS_ENTRY111) Histogram Entry Offset */
#define ISC_HIS_ENTRY112_REG_OFST      _UINT32_(0x5D0)     /* (ISC_HIS_ENTRY112) Histogram Entry Offset */
#define ISC_HIS_ENTRY113_REG_OFST      _UINT32_(0x5D4)     /* (ISC_HIS_ENTRY113) Histogram Entry Offset */
#define ISC_HIS_ENTRY114_REG_OFST      _UINT32_(0x5D8)     /* (ISC_HIS_ENTRY114) Histogram Entry Offset */
#define ISC_HIS_ENTRY115_REG_OFST      _UINT32_(0x5DC)     /* (ISC_HIS_ENTRY115) Histogram Entry Offset */
#define ISC_HIS_ENTRY116_REG_OFST      _UINT32_(0x5E0)     /* (ISC_HIS_ENTRY116) Histogram Entry Offset */
#define ISC_HIS_ENTRY117_REG_OFST      _UINT32_(0x5E4)     /* (ISC_HIS_ENTRY117) Histogram Entry Offset */
#define ISC_HIS_ENTRY118_REG_OFST      _UINT32_(0x5E8)     /* (ISC_HIS_ENTRY118) Histogram Entry Offset */
#define ISC_HIS_ENTRY119_REG_OFST      _UINT32_(0x5EC)     /* (ISC_HIS_ENTRY119) Histogram Entry Offset */
#define ISC_HIS_ENTRY120_REG_OFST      _UINT32_(0x5F0)     /* (ISC_HIS_ENTRY120) Histogram Entry Offset */
#define ISC_HIS_ENTRY121_REG_OFST      _UINT32_(0x5F4)     /* (ISC_HIS_ENTRY121) Histogram Entry Offset */
#define ISC_HIS_ENTRY122_REG_OFST      _UINT32_(0x5F8)     /* (ISC_HIS_ENTRY122) Histogram Entry Offset */
#define ISC_HIS_ENTRY123_REG_OFST      _UINT32_(0x5FC)     /* (ISC_HIS_ENTRY123) Histogram Entry Offset */
#define ISC_HIS_ENTRY124_REG_OFST      _UINT32_(0x600)     /* (ISC_HIS_ENTRY124) Histogram Entry Offset */
#define ISC_HIS_ENTRY125_REG_OFST      _UINT32_(0x604)     /* (ISC_HIS_ENTRY125) Histogram Entry Offset */
#define ISC_HIS_ENTRY126_REG_OFST      _UINT32_(0x608)     /* (ISC_HIS_ENTRY126) Histogram Entry Offset */
#define ISC_HIS_ENTRY127_REG_OFST      _UINT32_(0x60C)     /* (ISC_HIS_ENTRY127) Histogram Entry Offset */
#define ISC_HIS_ENTRY128_REG_OFST      _UINT32_(0x610)     /* (ISC_HIS_ENTRY128) Histogram Entry Offset */
#define ISC_HIS_ENTRY129_REG_OFST      _UINT32_(0x614)     /* (ISC_HIS_ENTRY129) Histogram Entry Offset */
#define ISC_HIS_ENTRY130_REG_OFST      _UINT32_(0x618)     /* (ISC_HIS_ENTRY130) Histogram Entry Offset */
#define ISC_HIS_ENTRY131_REG_OFST      _UINT32_(0x61C)     /* (ISC_HIS_ENTRY131) Histogram Entry Offset */
#define ISC_HIS_ENTRY132_REG_OFST      _UINT32_(0x620)     /* (ISC_HIS_ENTRY132) Histogram Entry Offset */
#define ISC_HIS_ENTRY133_REG_OFST      _UINT32_(0x624)     /* (ISC_HIS_ENTRY133) Histogram Entry Offset */
#define ISC_HIS_ENTRY134_REG_OFST      _UINT32_(0x628)     /* (ISC_HIS_ENTRY134) Histogram Entry Offset */
#define ISC_HIS_ENTRY135_REG_OFST      _UINT32_(0x62C)     /* (ISC_HIS_ENTRY135) Histogram Entry Offset */
#define ISC_HIS_ENTRY136_REG_OFST      _UINT32_(0x630)     /* (ISC_HIS_ENTRY136) Histogram Entry Offset */
#define ISC_HIS_ENTRY137_REG_OFST      _UINT32_(0x634)     /* (ISC_HIS_ENTRY137) Histogram Entry Offset */
#define ISC_HIS_ENTRY138_REG_OFST      _UINT32_(0x638)     /* (ISC_HIS_ENTRY138) Histogram Entry Offset */
#define ISC_HIS_ENTRY139_REG_OFST      _UINT32_(0x63C)     /* (ISC_HIS_ENTRY139) Histogram Entry Offset */
#define ISC_HIS_ENTRY140_REG_OFST      _UINT32_(0x640)     /* (ISC_HIS_ENTRY140) Histogram Entry Offset */
#define ISC_HIS_ENTRY141_REG_OFST      _UINT32_(0x644)     /* (ISC_HIS_ENTRY141) Histogram Entry Offset */
#define ISC_HIS_ENTRY142_REG_OFST      _UINT32_(0x648)     /* (ISC_HIS_ENTRY142) Histogram Entry Offset */
#define ISC_HIS_ENTRY143_REG_OFST      _UINT32_(0x64C)     /* (ISC_HIS_ENTRY143) Histogram Entry Offset */
#define ISC_HIS_ENTRY144_REG_OFST      _UINT32_(0x650)     /* (ISC_HIS_ENTRY144) Histogram Entry Offset */
#define ISC_HIS_ENTRY145_REG_OFST      _UINT32_(0x654)     /* (ISC_HIS_ENTRY145) Histogram Entry Offset */
#define ISC_HIS_ENTRY146_REG_OFST      _UINT32_(0x658)     /* (ISC_HIS_ENTRY146) Histogram Entry Offset */
#define ISC_HIS_ENTRY147_REG_OFST      _UINT32_(0x65C)     /* (ISC_HIS_ENTRY147) Histogram Entry Offset */
#define ISC_HIS_ENTRY148_REG_OFST      _UINT32_(0x660)     /* (ISC_HIS_ENTRY148) Histogram Entry Offset */
#define ISC_HIS_ENTRY149_REG_OFST      _UINT32_(0x664)     /* (ISC_HIS_ENTRY149) Histogram Entry Offset */
#define ISC_HIS_ENTRY150_REG_OFST      _UINT32_(0x668)     /* (ISC_HIS_ENTRY150) Histogram Entry Offset */
#define ISC_HIS_ENTRY151_REG_OFST      _UINT32_(0x66C)     /* (ISC_HIS_ENTRY151) Histogram Entry Offset */
#define ISC_HIS_ENTRY152_REG_OFST      _UINT32_(0x670)     /* (ISC_HIS_ENTRY152) Histogram Entry Offset */
#define ISC_HIS_ENTRY153_REG_OFST      _UINT32_(0x674)     /* (ISC_HIS_ENTRY153) Histogram Entry Offset */
#define ISC_HIS_ENTRY154_REG_OFST      _UINT32_(0x678)     /* (ISC_HIS_ENTRY154) Histogram Entry Offset */
#define ISC_HIS_ENTRY155_REG_OFST      _UINT32_(0x67C)     /* (ISC_HIS_ENTRY155) Histogram Entry Offset */
#define ISC_HIS_ENTRY156_REG_OFST      _UINT32_(0x680)     /* (ISC_HIS_ENTRY156) Histogram Entry Offset */
#define ISC_HIS_ENTRY157_REG_OFST      _UINT32_(0x684)     /* (ISC_HIS_ENTRY157) Histogram Entry Offset */
#define ISC_HIS_ENTRY158_REG_OFST      _UINT32_(0x688)     /* (ISC_HIS_ENTRY158) Histogram Entry Offset */
#define ISC_HIS_ENTRY159_REG_OFST      _UINT32_(0x68C)     /* (ISC_HIS_ENTRY159) Histogram Entry Offset */
#define ISC_HIS_ENTRY160_REG_OFST      _UINT32_(0x690)     /* (ISC_HIS_ENTRY160) Histogram Entry Offset */
#define ISC_HIS_ENTRY161_REG_OFST      _UINT32_(0x694)     /* (ISC_HIS_ENTRY161) Histogram Entry Offset */
#define ISC_HIS_ENTRY162_REG_OFST      _UINT32_(0x698)     /* (ISC_HIS_ENTRY162) Histogram Entry Offset */
#define ISC_HIS_ENTRY163_REG_OFST      _UINT32_(0x69C)     /* (ISC_HIS_ENTRY163) Histogram Entry Offset */
#define ISC_HIS_ENTRY164_REG_OFST      _UINT32_(0x6A0)     /* (ISC_HIS_ENTRY164) Histogram Entry Offset */
#define ISC_HIS_ENTRY165_REG_OFST      _UINT32_(0x6A4)     /* (ISC_HIS_ENTRY165) Histogram Entry Offset */
#define ISC_HIS_ENTRY166_REG_OFST      _UINT32_(0x6A8)     /* (ISC_HIS_ENTRY166) Histogram Entry Offset */
#define ISC_HIS_ENTRY167_REG_OFST      _UINT32_(0x6AC)     /* (ISC_HIS_ENTRY167) Histogram Entry Offset */
#define ISC_HIS_ENTRY168_REG_OFST      _UINT32_(0x6B0)     /* (ISC_HIS_ENTRY168) Histogram Entry Offset */
#define ISC_HIS_ENTRY169_REG_OFST      _UINT32_(0x6B4)     /* (ISC_HIS_ENTRY169) Histogram Entry Offset */
#define ISC_HIS_ENTRY170_REG_OFST      _UINT32_(0x6B8)     /* (ISC_HIS_ENTRY170) Histogram Entry Offset */
